[
    {
        "title": "Harry S Truman Event Timeline",
        "president": "Harry S Truman",
        "date": "1945-04-12",
        "sentence": "10/24/1945  after the Charter is ratified by China, France, the Soviet Union, the United Kingdom, the United States and a majority of other signatories"
    },
    {
        "title": "Harry S Truman Event Timeline",
        "president": "Harry S Truman",
        "date": "1945-04-12",
        "sentence": "08/01/1949 “China White Paper”—over 1000 pages long—is published"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1946-01-31",
        "sentence": "It is his resignation as Housing Administrator, and the suggestion that he become the Budget Director for China"
    },
    {
        "title": "Message to the Congress on the State of the Union and on the Budget for 1947",
        "president": "Harry S Truman",
        "date": "1946-01-21",
        "sentence": "The Soviet Union, France, and China have joined us in the purpose of introducing in the General Assembly a resolution for the establishment of such a commission"
    },
    {
        "title": "Message to the Congress on the State of the Union and on the Budget for 1947",
        "president": "Harry S Truman",
        "date": "1946-01-21",
        "sentence": "Our basic policy in the Far East is to encourage the development of a strong, independent, united, and democratic China"
    },
    {
        "title": "Message to the Congress on the State of the Union and on the Budget for 1947",
        "president": "Harry S Truman",
        "date": "1946-01-21",
        "sentence": "In accordance with the intentions of the Congress, lend-lease, except as to continuing military lend-lease in China, was terminated upon the surrender of Japan"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1946-01-15",
        "sentence": "We decided to hold it up for a future release until General Marshall's job is completed in China"
    },
    {
        "title": "Statement by the President on the Victory Clothing Collection for Overseas Relief.",
        "president": "Harry S Truman",
        "date": "1946-01-06",
        "sentence": "The spare garments contributed by Americans last spring has helped clothe twenty-five million men, women, and children in Europe, China and the Philippines, and has made possible the start of their rehabilitation this winter"
    },
    {
        "title": "Letters to the Members of the Board of Directors on the Termination of the Smaller War Plants Corporation.",
        "president": "Harry S Truman",
        "date": "1945-12-27",
        "sentence": "The countries to be visited by you are the Philippines, China, Korea, Australia, and New Zealand"
    },
    {
        "title": "Letters to the Members of the Board of Directors on the Termination of the Smaller War Plants Corporation.",
        "president": "Harry S Truman",
        "date": "1945-12-27",
        "sentence": "Maury Maverick, about the study which I wished him to make in China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "It is the firm belief of this Government that a strong, united and democratic China is of the utmost importance to the success of this United Nations organization and for world peace"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "A China disorganized and divided either by foreign aggression, such as that undertaken by the Japanese, or by violent internal strife, is an undermining influence to world stability and peace, now and in the future"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "It is thus in the most vital interest of the United States and all the United Nations that the people of China overlook no opportunity to adjust their internal differences promptly by methods of peaceful negotiation"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "The Government of the United States believes it essential: (1) That a cessation of hostilities be arranged between the armies of the National Government and the Chinese Communists and other dissident Chinese armed forces for the purpose of completing the return of all China to effective Chinese control, including the immediate evacuation of the Japanese forces"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "(2) That a national conference of representatives of major political elements be arranged to develop an early solution to the present internal strife--a solution which will bring about the unification of China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "The United States and the other United Nations have recognized the present National Government of the Republic of China as the only legal government in China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "It is the proper instrument to achieve the objective of a unified China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "The United States and the United Kingdom by the Cairo Declaration in 1943 and the Union of Soviet Socialist Republics by adhering to the Potsdam Declaration of last July and by the Sino-Soviet Treaty and Agreements of August 1945, are all committed to the liberation of China, including the return of Manchuria to Chinese control"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "These agreements were made with the National Government of the Republic of China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "In continuation of the constant and close collaboration with the National Government of the Republic of China in the prosecution of this war, in consonance with the Potsdam Declaration, and to remove possibility of Japanese influence remaining in China, the United States has assumed a definite obligation in the disarmament and evacuation of the Japanese troops"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "Accordingly the United States has been assisting and will continue to assist the National Government of the Republic of China in effecting the disarmament and evacuation of Japanese troops in the liberated areas"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "The United States Marines are in north China for that purpose"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "The United States recognizes and will continue to recognize the National Government of China and cooperate with it in international affairs and specifically in eliminating Japanese influence from China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "The maintenance of peace in the Pacific may be jeopardized, if not frustrated, unless Japanese influence in China is wholly removed and unless China takes her place as a unified, democratic and peaceful nation"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "This is the purpose of the maintenance for the time being of United States military and naval forces in China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "The United States is cognizant that the present National Government of China is a \"one-party government\" and believes that peace, unity and democratic reform in China will be furthered if the basis of this Government is broadened to include other political elements in the country"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "The existence of autonomous armies such as that of the Communist army is inconsistent with, and actually makes impossible, political unity in China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "With the institution of a broadly representative government, autonomous armies should be eliminated as such and all armed forces in China integrated effectively into the Chinese National Army"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "In line with its often expressed views regarding self-determination, the United States Government considers that the detailed steps necessary to the achievement of political unity in China must be worked out by the Chinese themselves and that intervention by any foreign government in these matters would be inappropriate"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "The United States Government feels, however, that China has a clear responsibility to the other United Nations to eliminate armed conflict within its territory as constituting a threat to world stability and peace--a responsibility which is shared by the National Government and all Chinese political and military groups"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "As China moves toward peace and unity along the lines described above, the United States would be prepared to assist the National Government in every reasonable way to rehabilitate the country, improve the agrarian and industrial economy, and establish a military organization capable of discharging China's national and international responsibilities for the maintenance of peace and order"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1945-12-15",
        "sentence": "In furtherance of such assistance, it would be prepared to give favorable consideration to Chinese requests for credits and loans under reasonable conditions for projects which would contribute toward the development of a healthy economy throughout China and healthy trade relations between China and the United States."
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1945-12-12",
        "sentence": "President, I have been asked to inquire when the Marines will be taken out of China? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1945-12-12",
        "sentence": "The Marines will be taken out of China when our surrender terms with Japan have been carried out"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1945-12-12",
        "sentence": "At a later time, when General Marshall starts for China, I shall announce a complete policy for the guidance of General Marshall; and I will announce it here at a press conference"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1945-12-07",
        "sentence": "Will General Marshall try getting the two factions in China together again, Mr"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1945-11-29",
        "sentence": "Can you tell us, sir, the instructions under which General Marshall is going to China, as a result of your conversation yesterday? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1945-11-29",
        "sentence": "He is Special Envoy to China for a special job, and it is temporary"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1945-11-29",
        "sentence": "He will go and carry out the policy which we have always had in China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1945-11-20",
        "sentence": "President, have you had any official expressions of opinion from Russia, China, or France as to the Anglo-American-Canadian pronouncement on the atomic bomb? THE PRESIDENT"
    },
    {
        "title": "Special Message to the Congress on U.S. Participation in the United Nations Relief and Rehabilitation Administration.",
        "president": "Harry S Truman",
        "date": "1945-11-13",
        "sentence": "It has initiated a preliminary program of assistance to China"
    },
    {
        "title": "Special Message to the Congress on U.S. Participation in the United Nations Relief and Rehabilitation Administration.",
        "president": "Harry S Truman",
        "date": "1945-11-13",
        "sentence": "The end of the war with Japan has made it possible to estimate the magnitude of the relief requirements of China and other Far Eastern areas"
    },
    {
        "title": "Special Message to the Congress on U.S. Participation in the United Nations Relief and Rehabilitation Administration.",
        "president": "Harry S Truman",
        "date": "1945-11-13",
        "sentence": "China presents the largest of all the relief responsibilities which UNRRA now faces"
    },
    {
        "title": "Address on Foreign Policy at the Navy Day Celebration in New York City.",
        "president": "Harry S Truman",
        "date": "1945-10-27",
        "sentence": "The people in the United States, in Russia, and Britain, in France and China, in collaboration with all the other peace-loving people, must take the course of current history into their own hands and mold it in a new direction-the direction of continued cooperation"
    },
    {
        "title": "Statement by the President on the 34th Anniversary of the Chinese Republic.",
        "president": "Harry S Truman",
        "date": "1945-10-10",
        "sentence": "THE AMERICAN PEOPLE today join the people of all free nations in saluting the people of China upon this thirty-fourth anniversary of China's national revolution"
    },
    {
        "title": "Statement by the President on the 34th Anniversary of the Chinese Republic.",
        "president": "Harry S Truman",
        "date": "1945-10-10",
        "sentence": "For the first time in fourteen years China is able to celebrate the Double Tenth without fear of aggression"
    },
    {
        "title": "Statement by the President on the 34th Anniversary of the Chinese Republic.",
        "president": "Harry S Truman",
        "date": "1945-10-10",
        "sentence": "With final victory in the war achieved, China now faces the urgent problems of reconstruction of her devastated nation--a task which will require all of the inspired leadership and full cooperation of the Chinese people which have been so evident during these years of desperate struggle for survival and without which Japan's savage aims of aggression might have succeeded"
    },
    {
        "title": "Remarks at the Pemiscot County Fair, Caruthersville, Missouri.",
        "president": "Harry S Truman",
        "date": "1945-10-07",
        "sentence": "And that applies to you, and you, just as it applies to Great Britain and France and China and Russia and Czechoslovakia, and Poland and Brazil"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1945-10-03",
        "sentence": "Stettinius that they did vote to locate the headquarters in the United States, and that China and Australia favor San Francisco"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1946-02-15",
        "sentence": "President, when you sent General Marshall out to China, you gave him certain instructions, which you made public, on our objectives and our policies in China"
    },
    {
        "title": "Statement by the President on Announcing the Termination of the American Production Mission in China.",
        "president": "Harry S Truman",
        "date": "1945-09-29",
        "sentence": "WHILE concluding this war mission, the American Government desires to continue its close cooperation with China"
    },
    {
        "title": "Statement by the President on the Liberation of Korea.",
        "president": "Harry S Truman",
        "date": "1945-09-18",
        "sentence": "The building of a great nation has now begun with the assistance of the United States, China, Great Britain and the Soviet Union, who are agreed that Korea shall become free and independent"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1945-08-30",
        "sentence": "She was in to pay her respects before returning to China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1945-08-30",
        "sentence": "Chiang talk with you about the relations of China with America and a meeting between you and the Generalissimo? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1945-08-23",
        "sentence": "President, are the Big Three, as reported, planning joint action to avert civil war in China? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1945-08-14",
        "sentence": "Great Britain, Russia, and China will be represented by high-ranking officers"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1945-08-14",
        "sentence": "This is the official Swiss communique handed to the Secretary of State: \"Sir: I have the honor to refer to your note of August 11, in which you requested me to transmit to my Government the reply of the Governments of the United States, the United Kingdom, the Union of Soviet Socialist Republics, and China to the message from the Japanese Government which was communicated in my note of August 10"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1945-08-14",
        "sentence": "\"At 20.10 today (Swiss Time) the Japanese Minister to Switzerland conveyed the following written statement to the Swiss Government for transmission to the four Allied governments: \"'Communication of the Japanese Government of August 14, 1945, addressed to the Governments of the United States, Great Britain, the Soviet Union, and China: \"'With reference to the Japanese Government's note of August 10 regarding their acceptance of the provisions of the Potsdam declaration and the reply of the Governments of the United States, Great Britain, the Soviet Union, and China sent by American Secretary of State Byrnes under the date of August 11, the Japanese Government have the honor to communicate to the Governments of the four powers as follows: \"'1"
    },
    {
        "title": "Joint Report With Allied Leaders on the Potsdam Conference.",
        "president": "Harry S Truman",
        "date": "1945-08-02",
        "sentence": "There shall be established a Council composed of the foreign ministers of the United Kingdom, the Union of Soviet Socialist Republics, China, France and the United States"
    },
    {
        "title": "Joint Report With Allied Leaders on the Potsdam Conference.",
        "president": "Harry S Truman",
        "date": "1945-08-02",
        "sentence": "In accordance with the decision of the conference the three governments have each addressed an identical invitation to the governments of China and France to adopt this text and to join in establishing the Council"
    },
    {
        "title": "Proclamation by the Heads of Governments, United States, China and the United Kingdom",
        "president": "Harry S Truman",
        "date": "1945-07-26",
        "sentence": "(1) We, the President of the United States, the President of the National Government of the Republic of China and the Prime Minister of Great Britain, representing the hundreds of millions of our countrymen, have conferred and agree that Japan shall be given an opportunity to end this war"
    },
    {
        "title": "Proclamation by the Heads of Governments, United States, China and the United Kingdom",
        "president": "Harry S Truman",
        "date": "1945-07-26",
        "sentence": "(2) The prodigious land, sea and air forces of the United States, the British Empire and of China, many times reinforced by their armies and air fleets from the west are poised to strike the final blows upon Japan"
    },
    {
        "title": "Proclamation by the Heads of Governments, United States, China and the United Kingdom",
        "president": "Harry S Truman",
        "date": "1945-07-26",
        "sentence": "President of China by wire"
    },
    {
        "title": "Statement by the President Commending the Office of Price Administration.",
        "president": "Harry S Truman",
        "date": "1945-05-01",
        "sentence": "We must supplement the economic resources of our fighting allies, such as Britain, Russia, China and France, who have suffered great devastation in this war"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1947-02-20",
        "sentence": "President, it has been reported the Navy is withdrawing from China"
    },
    {
        "title": "Special Message to the Congress on Extension of the Second War Powers Act.",
        "president": "Harry S Truman",
        "date": "1947-01-31",
        "sentence": "In the case of antimony, we must wait for resumption of shipments from China, the primary pre-war source"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1947-01-23",
        "sentence": "We discussed China"
    },
    {
        "title": "Annual Budget Message to the Congress: Fiscal Year 1948",
        "president": "Harry S Truman",
        "date": "1947-01-10",
        "sentence": "Except for some military aid to China and minor items, lend-lease was terminated after VJ-day"
    },
    {
        "title": "Annual Budget Message to the Congress: Fiscal Year 1948",
        "president": "Harry S Truman",
        "date": "1947-01-10",
        "sentence": "In millions ] Expenditures Actual, Estimate, Estimate, Appropria- \n      Program or agency concerned 1946 1947 1948 tions, 1948 Reconstruction and stabilization: \n      Subscriptions to International Fund and Bank $159 $1,426 \n      Treasury loan to United Kingdom 1,500 $1,200 \n      Reconstruction Finance Corporation loans to United \n      Kingdom -39 -39 -40 \n      Export-Import Bank loans 464 1,025 730 \n      Aid to China 120 \n      U.S"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "[1.] Reiteration of the policy toward China was released today"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "So the people would know what our policy toward China is"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "President, can--I have one more question about China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "President, getting back to China--is that 500 million dollar import credit endangered by the present statement? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "President, are you urging the Nationalist government in China to accept Communists in the cabinet? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "President, would you care to comment on the suggestion by Senators Murray and Flanders that the work we have been doing in China be extended by the establishment of a three-nation board--the Soviet Union, Britain, and United States ? THE PRESIDENT"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "LAST DECEMBER I made a statement of this Government's views regarding China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": " We believed then and do now that a united and democratic China is of the utmost importance to world peace, that a broadening of the base of the National Government to make it representative of the Chinese people will further China's progress toward this goal, and that China has a clear responsibility to the other United Nations to eliminate armed conflict within its territory as constituting a threat to world stability and peace"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "Beyin issued a statement which said, in part: \"The three Foreign Secretaries exchanged views with regard to the situation in China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "They were in agreement as to the need for a unified and democratic China under the National Government for broad participation by democratic elements in all branches of the National Government, and for a cessation of civil strife"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "They affirmed their adherence to the policy of non-interference in the internal affairs of China.\" 1 See 1945 volume, this series [ ],  "
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "We recognized the National Government of the Republic of China as the legal government"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "And finally, as China moved toward peace and unity along the lines mentioned, we were prepared to assist the Chinese economically and in other ways"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "I asked General Marshall to go to China as my representative"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "We had agreed upon my statement of the United States Government's views and policies regarding China as his directive"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "He knew full well in undertaking the mission that halting civil strife, broadening the base of the Chinese Government and bringing about a united, democratic China were tasks for the Chinese themselves"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "The United States, the United Kingdom and the Union of Soviet Socialist Republics all committed themselves to the liberation of China, including the return of Manchuria to Chinese control"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "Our Government had agreed to assist the Chinese Government in the reoccupation of areas liberated from the Japanese, including Manchuria, because of China's lack of shipping and transport planes"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "Three armies were moved by air and eleven by sea, to central China, Formosa, north China and Manchuria"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "We regarded our commitment to assist the Chinese in this program as of overwhelming importance to the future peace of China and the whole Far East"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "At the request of the Chinese Government we had retained a considerable number of American troops in China, and immediately after V-J Day we landed a corps of Marines in north China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "General Marshall also faced a most unpropitious internal situation on his arrival in China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "The wartime destruction of factories and plants, the war-induced inflation in China, the Japanese action in shutting down the economy of occupied China immediately after V-J Day, and finally the destruction of communications combined to paralyze the economic life of the country, spreading untold hardship to millions, robbing the victory over the Japanese of significance to most Chinese and seriously aggravating all the tensions and discontents that existed in China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "Progress toward solution of China's internal difficulties by the Chinese themselves was essential to the rapid and effective completion of most of the programs in which we had already pledged our assistance to the Chinese Government"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "Robertson, Charge d'Affaires of the American Embassy in China, served as chairman until his return to this country in the fall"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "He also pointed out that these agreements could not be satisfactorily implemented and given substance unless China's economic disintegration were checked and particularly unless the transportation system could be put in working order"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "While comprehensive large scale aid has been delayed, this Government has completed its wartime lend-lease commitments to China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "Lend-lease assistance was extended to China to assist her in fighting the Japanese, and later to fulfill our promise to assist in re-occupying the country from the Japanese"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "Almost half the total made available to China consisted of services, such as those involved in air and water transportation of troops"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "According to the latest figures reported, lend-lease assistance to China up to V-J Day totaled approximately $870,000,000"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "A considerable quantity of civilian goods has also been made available by our agreement with China for the disposal of surplus property which enabled us to liquidate a sizable indebtedness and to dispose of large quantities of surplus material"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "Progressive currency inflation in China rendered it impossible to determine the exact value of the sum in United States currency"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "China agreed to buy all surplus property owned by the United States in China and on seventeen Pacific Islands and bases with certain exceptions"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "Aircraft, all nondemilitarized combat material, and fixed installations outside of China were excluded"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "The Chinese Government cancelled all but 30,000,000 United States dollars of our indebtedness for the Chinese currency, and promised to make available the equivalent of 35,000,000 United States dollars for use in paying United States governmental expenses in China and acquiring and improving buildings and properties for our diplomatic and consular establishments"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "Before General Marshall arrived in China for the second time, in April, there was evidence that the truce agreement was being disregarded"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "There has been encouraging progress in other fields, particularly the elimination of Japanese from China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "The Chinese Government was responsible under an Allied agreement for the disarmament of all Japanese military personnel and for the repatriation of all Japanese civilians and military personnel from China, Formosa and French Indo-China north of the sixteenth degree of latitude"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "Much has been said of the presence of United States armed forces in China during the past year"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "No one could prophesy in advance how well the Japanese forces in China would observe the surrender terms"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "Another duty our forces undertook immediately upon the Japanese surrender was to provide the necessary protection so that coal from the great mines northeast of Tientsin could reach the sea for shipment to supply the cities and railroads of central China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "Other units of our forces were engaged in searching for the bodies or graves of American soldiers who had died fighting the Japanese in China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "At peak strength a year ago we had some 13,000 soldiers, sailors and marines in China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "We have undertaken some emergency measures of economic assistance to prevent the collapse of China's economy and have liquidated our own wartime financial account with China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "It is a matter of deep regret that China has not yet been able to achieve unity by peaceful methods"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "We are ready to help China as she moves toward peace and genuine democratic government"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "China is a sovereign nation"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "We recognize that fact and we recognize the National Government of China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "We are pledged not to interfere in the internal affairs of China"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "As ways and means are presented for constructive aid to China, we will give them careful and sympathetic consideration"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "An example of such aid is the recent agricultural mission to China under Dean Hutchison of the University of California sent at the request of the Chinese Government"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "When conditions in China improve, we are prepared to consider aid in carrying out other projects, unrelated to civil strife, which would encourage economic reconstruction and reform in China and which, in so doing, would promote a general revival of commercial relations between American and Chinese businessmen"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "We believe that our hopes for China are identical with what the Chinese people themselves most earnestly desire"
    },
    {
        "title": "Statement by the President: United States Policy Toward China.",
        "president": "Harry S Truman",
        "date": "1946-12-18",
        "sentence": "We shall therefore continue our positive and realistic policy toward China which is based on full respect for her national sovereignty and on our traditional friendship for the Chinese people and is designed to promote international peace."
    },
    {
        "title": "Statement by the President Concerning the Japanese Mandated Islands.",
        "president": "Harry S Truman",
        "date": "1946-11-06",
        "sentence": "Insofar as the Japanese Mandated Islands are concerned, this Government is transmitting for information to the other members of the Security Council (Australia, Brazil, China, Egypt, France, Mexico, the Netherlands, Poland, the Union of Soviet Socialist Republics and the United Kingdom) and to New Zealand and the Philippines a draft of a strategic area trusteeship agreement which sets forth the terms upon which this Government is prepared to place those islands under trusteeship"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1947-11-13",
        "sentence": "President, are you planning a new policy statement regarding China ? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1947-10-16",
        "sentence": "Do you intend to make public General Wedemeyer's report on China? THE PRESIDENT"
    },
    {
        "title": "Address Before the Canadian Parliament in Ottawa.",
        "president": "Harry S Truman",
        "date": "1947-06-11",
        "sentence": "We imported from Canada more than twice the value of goods we received from the United Kingdom, France, China, and Russia combined"
    },
    {
        "title": "Address Before the Canadian Parliament in Ottawa.",
        "president": "Harry S Truman",
        "date": "1947-06-11",
        "sentence": "The United States purchases from Canada were about 6 times our purchases from Great Britain, and nearly 10 times those from China, and 11 times those from France"
    },
    {
        "title": "Executive Order 9843—Authorizing the Secretary of the Navy to Transfer Certain Vessels and Material and to Furnish Certain Assistance to the Republic of China",
        "president": "Harry S Truman",
        "date": "1947-04-25",
        "sentence": "WHEREAS the act of July 16, 1946, Public Law 512, Seventy-ninth Congress, provides, in part: \"That notwithstanding the provisions of any other law, the President is authorized, whenever in his discretion the public interests render such a course advisable, or will assist in relieving United States forces of duty in China or putting the government of the Republic of China in better position to protect or improve the safety of navigation in its waters, to provide to the Republic of China such naval services, training, plans, and technical advice as he may deem proper; and to dispose of naval vessels and craft, not to exceed two hundred and seventy-one vessels and craft under authority of this Act, which are in excess of the naval needs of the United States, floating drydocks of capacity sufficient to accommodate any vessel or craft disposed of under authority of this Act, and material necessary for the operation and maintenance of the vessels and craft disposed of under authority of this Act sand for the training of the crews of such vessels and craft, to the Republic of China by sale, exchange, lease, gift, or transfer for cash, credit, or other property, with or without warranty, or upon such other terms and conditions as he may deem proper: Provided, That prior to the disposition under the authority of this Act of any battleship, aircraft carrier of any type, cruiser, destroyer (but not destroyer escort), or submarine the President shall first obtain the authority of the Congress in each instance: Provided further, That no information, plans, advice, material, documents, blueprints, or other papers, bearing a secret or top-secret classification shall be disposed of or transferred under authority of this Act"
    },
    {
        "title": "Executive Order 9843—Authorizing the Secretary of the Navy to Transfer Certain Vessels and Material and to Furnish Certain Assistance to the Republic of China",
        "president": "Harry S Truman",
        "date": "1947-04-25",
        "sentence": "The President is authorized, upon application from the Republic of China, and whenever in his discretion the public interests render such a course advisable, to detail not to exceed one hundred officers and two hundred enlisted men of the United States Navy and Marine Corps to assist the Republic of China in naval matters: Provided, That United States naval or Marine Corps personnel shall not accompany Chinese troops, aircraft, or ships on other than training maneuvers or cruises * * * \" WHEREAS the Republic of China has requested the United States to transfer to it certain specified naval vessels, craft, and floating drydocks, and to furnish it certain technical advice and assistance in connection with the organization and maintenance by it of a naval establishment; and WHEREAS such vessels and craft are in excess of the naval needs of the United States; and WHEREAS it appears that the transfer of such vessels, craft, and floating drydocks, and the furnishing of such advice and assistance to the Republic of China would be in accordance with the conditions and limitations of the said act of July 16 1946, and would be in the public interest; NOW, THEREFORE, by virtue of the authority vested in me by the said act of July 16, 1946, and as President of the United States and as Commander in Chief of the Army and Navy of the United States, it is hereby ordered as follows: SECTION 1"
    },
    {
        "title": "Executive Order 9843—Authorizing the Secretary of the Navy to Transfer Certain Vessels and Material and to Furnish Certain Assistance to the Republic of China",
        "president": "Harry S Truman",
        "date": "1947-04-25",
        "sentence": "Subject to the conditions and limitations contained in the said act of July 16, 1946, the Secretary of the Navy is authorized: (a) To transfer to the Republic of China without compensation the said vessels, craft, and floating drydocks"
    },
    {
        "title": "Executive Order 9843—Authorizing the Secretary of the Navy to Transfer Certain Vessels and Material and to Furnish Certain Assistance to the Republic of China",
        "president": "Harry S Truman",
        "date": "1947-04-25",
        "sentence": "(b) To repair, outfit, and equip the vessels, craft, and floating drydocks which are to be transferred under paragraph (a) of this section, and to transfer material deemed by the Secretary of the Navy to be necessary for the operation and maintenance of the vessels and craft so transferred, all on the basis of cash reimbursement of the cost thereof by the Republic of China which has not been classified as secret or top-secret as the Secretary of the Navy may deem proper"
    },
    {
        "title": "Executive Order 9843—Authorizing the Secretary of the Navy to Transfer Certain Vessels and Material and to Furnish Certain Assistance to the Republic of China",
        "president": "Harry S Truman",
        "date": "1947-04-25",
        "sentence": "(e) To detail not more than one hundred officers and two hundred enlisted men of the United States Navy or Marine Corps to assist the Republic of China in naval matters under such conditions and subject to such rules and regulations as the Secretary of the navy may prescribe"
    },
    {
        "title": "Executive Order 9787—Amendment of Executive Order 7747 of November 20, 1937, as Amended, Establishing the San Clemente Island Naval Defensive Sea Area",
        "president": "Harry S Truman",
        "date": "1946-10-05",
        "sentence": "96), the area of water surrounding San Clemente Island, California, extended from low-water mark out for a distance of three hundred yards beyond the low-water mark, except in Wilson Cove, where it is to extend one hundred yards beyond low-water mark, and including that part of Pyramid Cove lying north of a line between a point one thousand yards south of China Point light and a point three hundred yards south of White washed Rock, is hereby established as a defensive sea area for purposes of national defense, subject to the uses reserved for the Department of Commerce by Executive Order 6897 of November 7, 1934"
    },
    {
        "title": "Remarks to the Cadet Corps at West Point.",
        "president": "Harry S Truman",
        "date": "1946-09-28",
        "sentence": "Three shining examples: General Marshall who is now in China doing a wonderful job for the Government of the United States, and General Bradley, and Admiral Moreell who has just retired from service"
    },
    {
        "title": "Remarks to a Group of Editors and Executives of the McGraw-Hill Publishing Company.",
        "president": "Harry S Truman",
        "date": "1946-07-17",
        "sentence": "The difficulties in China are still very, very bad, but we appointed a new Ambassador the other day, which will be very helpful to General Marshall, and we hope in the long run that peace will come out of the Chinese situation; in which case there is an unusual chance for a development in the Far East which I think will be exceedingly helpful to us from a trade standpoint"
    },
    {
        "title": "Remarks to the Members of the Youth Conference on Famine Relief.",
        "president": "Harry S Truman",
        "date": "1946-07-15",
        "sentence": "I wish all of you could see the situation as it really is in Poland and Greece and Hungary and Austria and Germany and China"
    },
    {
        "title": "The President's Regular News Conference",
        "president": "Harry S Truman",
        "date": "1946-05-16",
        "sentence": "President, are you considering Edwin Pauley for Ambassador to China? THE PRESIDENT"
    },
    {
        "title": "The President's Regular News Conference",
        "president": "Harry S Truman",
        "date": "1946-05-16",
        "sentence": "President, dispatches from China indicate that General Marshall's patient efforts to bring the Communists and the Kuomintang together have not been rewarded"
    },
    {
        "title": "Citation Accompanying the Medal for Merit Awarded to William D. Pawley.",
        "president": "Harry S Truman",
        "date": "1946-05-13",
        "sentence": "His initiative provided the means of action in the air which proved an important factor in preserving the Republic of China"
    },
    {
        "title": "Citation Accompanying the Medal for Merit Awarded to William D. Pawley.",
        "president": "Harry S Truman",
        "date": "1946-05-13",
        "sentence": "Pawley accepted the responsibility for employment of the American Volunteer Group (The Flying Tigers), and through his untiring efforts this splendid company of volunteers was assembled and transported to China"
    },
    {
        "title": "The President's Special Conference With the American Society of Newspaper Editors",
        "president": "Harry S Truman",
        "date": "1946-04-18",
        "sentence": "I wish I could send each one of you to Greece and to Poland, and to--to Norway and to India, and to China and to the Philippines"
    },
    {
        "title": "The President's Special Conference With the American Society of Newspaper Editors",
        "president": "Harry S Truman",
        "date": "1946-04-18",
        "sentence": "President, would you care to say anything about China? THE PRESIDENT"
    },
    {
        "title": "The President's Special Conference With the American Society of Newspaper Editors",
        "president": "Harry S Truman",
        "date": "1946-04-18",
        "sentence": "General Marshall is acting for me in China, and I am behind him with all I have; and he is doing a good job"
    },
    {
        "title": "Telegram to Herbert Hoover, Honorary Chairman, Famine Emergency Committee.",
        "president": "Harry S Truman",
        "date": "1946-04-18",
        "sentence": "This would make your trip to India, China and Japan, by way of the United States"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1946-04-17",
        "sentence": "I would like very much to go to Japan--China, too"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1946-04-11",
        "sentence": "President, now that General Marshall is expected to go back to China, can you tell us anything about his conference here, and what the results of them may be? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1946-04-11",
        "sentence": "He will leave for China at once"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1946-04-11",
        "sentence": "Can you tell us anything about what he wanted them--he spoke a great deal about economic and material assistance to China, to the press? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1946-04-11",
        "sentence": "Let's wait till he gets back to China and authorizes the release, and the whole thing will be turned loose for the benefit of everybody, just as the policy will be turned loose, at the proper time, for China"
    },
    {
        "title": "Address in Chicago on Army Day.",
        "president": "Harry S Truman",
        "date": "1946-04-06",
        "sentence": "In China we are supporting a free and democratic government"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-12-30",
        "sentence": "That is the recognized government of China by all the governments of the world"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-12-30",
        "sentence": "President, have you decided yet when you will ask for aid for China in the new Congress? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-12-30",
        "sentence": "You said aid for China would come out in your State of the Union Message? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-12-09",
        "sentence": "President, will you meet any further in the week with Madame Chiang to discuss China aid? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-12-02",
        "sentence": "President, can you enlighten us any on the China situation,  or do you intend to make a statement of policy about it, or can you clear Up-- THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-12-02",
        "sentence": "I have on three different occasions made a statement on China policy"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-12-02",
        "sentence": "President, do you see any reason why we should assume certain political and military responsibilities in China, that we have in Greece? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-12-02",
        "sentence": "President, is General MacArthur going to China? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-12-02",
        "sentence": "I am not answering questions on China today"
    },
    {
        "title": "The President's News Conference at Key West, Florida",
        "president": "Harry S Truman",
        "date": "1948-11-16",
        "sentence": "President, are you planning any new action on China? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference at Key West, Florida",
        "president": "Harry S Truman",
        "date": "1948-11-16",
        "sentence": "We are in communication with the President of China now"
    },
    {
        "title": "The President's News Conference at Key West, Florida",
        "president": "Harry S Truman",
        "date": "1948-11-16",
        "sentence": "President, in connection with China, there was a story out of Washington that the Navy might divert some warships to China and the upper Yangtze River to aid Americans and bolster the morale of the Chinese Nationalist Government, the decision being up to you? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference at Key West, Florida",
        "president": "Harry S Truman",
        "date": "1948-11-16",
        "sentence": "President, are you planning any emergency aid to China in the way of ammunition? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference at Key West, Florida",
        "president": "Harry S Truman",
        "date": "1948-11-16",
        "sentence": "We have been carrying out the demands of Congress which gave an appropriation of $125 million for aid to China"
    },
    {
        "title": "The President's News Conference at Key West, Florida",
        "president": "Harry S Truman",
        "date": "1948-11-16",
        "sentence": "We spent about $112 million of that and we are now trying to make the balance of it go for the distance in China"
    },
    {
        "title": "Address at the Brooklyn Academy of Music, New York City",
        "president": "Harry S Truman",
        "date": "1948-10-29",
        "sentence": "They want us to stop helping European countries and China"
    },
    {
        "title": "Address in Milwaukee, Wisconsin",
        "president": "Harry S Truman",
        "date": "1948-10-14",
        "sentence": "We were joined by France, China, and the Soviet Union in sponsoring the establishment of such a commission"
    },
    {
        "title": "Rear Platform and Other Informal Remarks in Nevada and California",
        "president": "Harry S Truman",
        "date": "1948-09-22",
        "sentence": "All of our efforts for peace--the European recovery program, aid to China, and Greece, and Turkey, support for the western European Union, the Inter-American Defense Pacts--all these are in accord with the principles of the United Nations, and are in support of its aims"
    },
    {
        "title": "Executive Order 10000—Regulations Governing Additional Compensation and Credit Granted Certain Employees of the Federal Government Serving Outside the United States",
        "president": "Harry S Truman",
        "date": "1948-09-16",
        "sentence": "7062 of June 5, 1935: Accra, Gold Coast, West Africa Addis Ababa, Ethiopia Basra, Iraq Beira, Mozambique, Africa Bogota, Colombia Brazzaville, French Equatorial Africa Camaguey, Cuba Caripito, Venezuela Cayenne, French Guiana Chengtu, China Corumba, Brazil Ciudad Bolivar, Venezuela Coatzacoalcos, Mexico Cucuta, Colombia Dhahran, Saudi Arabia Florianopolis, Brazil Fortaleza, Brazil Godthaab, Greenland Guadeloupe, French West Indies Iquique, Chile Iquitos, Peru Iskenderun, Turkey Jidda, Saudi Arabia Kabul, Afghanistan Kunming, China Kwellin, China Lanchow, China La Paz, Baja California, Mexico Manila, P.I"
    },
    {
        "title": "Executive Order 10000—Regulations Governing Additional Compensation and Credit Granted Certain Employees of the Federal Government Serving Outside the United States",
        "president": "Harry S Truman",
        "date": "1948-09-16",
        "sentence": "Manta, Ecuador Natal, Brazil New Delhi, India Noumea, New Caledonia Paramaribo, Surinam Port au Prince, Haiti Puerto Cabezas, Nicaragua Puerto la Cruz, Venezuela Puntarenas, Coast Rica Quito, Ecuador Rio Hacha, Colombia Samsun, Turkey Sao Vincente, Cape Verde Islands Stan, China Suez, Egypt Suva, Fiji Islands Tabriz, Iran Tapachula, Mexico Tegucigalpa, Honduras Tehran, Iran Tihwa, China Victoria, Brazil Vladivostok, U.S.S.R"
    },
    {
        "title": "Executive Order 10000—Regulations Governing Additional Compensation and Credit Granted Certain Employees of the Federal Government Serving Outside the United States",
        "president": "Harry S Truman",
        "date": "1948-09-16",
        "sentence": "The following places at which diplomatic or consular offices are now maintained are hereby removed from the list of unhealthful posts referred to in section 501 above: Acapulco, Mexico Alvaro Obregon (Frontera) Amoy, China Bluefields, Nicaragua Boma, Belgian Congo Caibarien, Cuba Cienfuegos, Cuba Corinto, Nicaragua Foochow, China Habana, Cuba Lourence Marques, Mozambique Manaos, Brazil Manzanillo, Mexico Matanzas, Cuba Medan, Sumatra Muscat (Maskat), Oman Nuevitas, Cuba Penang, Straits Settlements Port Limon, Costa Rica Progreso, Mexico Puerto Barrios, Guatemala Puerto Cabello, Venezuela Puerto Castilla, Honduras Puerto Plata, Domincan Republic Salina Cruz, Mexico Sandakan, British North Borneo Santa Marta, Colombia Santa Rosalia, Mexico Surabaya, Java Swatow, China (b) The cancellation of the designation of the above thirty posts as unhealthful shall not affect any credit which has accrued for service at these posts prior to the date of this order"
    },
    {
        "title": "Address in Philadelphia Upon Accepting the Nomination of the Democratic National Convention",
        "president": "Harry S Truman",
        "date": "1948-07-15",
        "sentence": "We have started the foreign aid program, which means the recovery of Europe and China, and the Far East"
    },
    {
        "title": "Proclamation 2798—Supplementing Proclamations of December 16, 1947 and January 1, 1948, Carrying Out General Agreement on Tariffs and Trade and Exclusive Trade Agreement with Cuba, Respectively",
        "president": "Harry S Truman",
        "date": "1948-07-15",
        "sentence": "(1946) 1352(c)), on October 30, 1947 the President entered into a trade agreement with the Governments of the Commonwealth of Australia, the Kingdom of Belgium, the United States of Brazil, Burma, Canada, Ceylon, the Republic of Chile, the republic of China, the Republic of Cuba, the Czechoslovak Republic, the French Republic, India, Lebanon, the Grand Duchy of Luxemburg, the Kingdom of the Netherlands, New Zealand, the Kingdom of Norway, Pakistan, Southern Rhodesia, Syria, the Union of South Africa, and the United Kingdom of Great Britain and northern Ireland, which trade agreement consists of the General Agreement on Tariffs and Trade and the related Protocol of Provisional Application thereof, together with the Final Act Adopted at the Conclusion of the Second Session of the Preparatory Committee of the United Nations Conference on Trade and Employment which authenticated the texts of said general agreement and said protocol;  on December 16, 1947 by Proclamation 2761A the President proclaimed such modifications of existing duties and other import restrictions of the United States of America and such continuance of existing customs or excise treatment of articles imported into the United States of America as were then found to be required or appropriate to carry out said trade agreement on and after January 1, 1948 (12 F.R"
    },
    {
        "title": "Statement by the President Upon Signing the Foreign Aid Appropriation Act.",
        "president": "Harry S Truman",
        "date": "1948-06-28",
        "sentence": "6801, the Foreign Aid Appropriation Act, 1949, providing funds for the first year of the European recovery program; for aid to Greece, Turkey, and China; for meeting our occupation responsibilities in Europe and the Far East; and for our participation in the International Children's Fund and the International Refugee Organization"
    },
    {
        "title": "Proclamation 2792—Supplementing Proclamations of December 16, 1947 and January 1, 1948, Carrying Out General Agreement on Tariffs and Trade and Exclusive Trade Agreement with Cuba, Respectively",
        "president": "Harry S Truman",
        "date": "1948-06-25",
        "sentence": "(1946) 1352(c)), on October 30, 1947 the President entered into a trade agreement with the Governments of the Commonwealth of Australia, the Kingdom of Belgium, the United States of Brazil, Burma, Canada, Ceylon, the Republic of Chile, the Republic of China, the Republic of Cuba, the Czechoslovak Republic, the French Republic, India, Lebanon, the Grand Duchy of Luxemburg, the Kingdom of the Netherlands, New Zealand, the Kingdom of Norway, Pakistan, Southern Rhodesia, Syria, the Union of South Africa, and the United Kingdom of Great Britain and Northern Ireland, which trade agreement consists of the General Agreement on Tariffs and Trade and the related Protocol of Provisional Application thereof, together with the Final Act Adopted at the Conclusion of the Second Session of the Preparatory Committee of the United Nations Conference on Trade and Employment which authenticated the texts of said general agreement and said protocol;  on December 16, 1947 by Proclamation 2761A the President proclaimed such modifications of existing duties and other import restrictions of the United States of America and such continuance of existing customs or excise treatment of articles imported into the United States of America as were then found to be required or appropriate to carry out said trade agreement on and after January 1, 1948 (12 F.R"
    },
    {
        "title": "Proclamation 2791—Supplementing Proclamation of December 16, 1947 Carrying Out General Agreement on Tariffs and Trade",
        "president": "Harry S Truman",
        "date": "1948-06-12",
        "sentence": "(1946) 1352(c), on October 30, 1947 the President entered into a trade agreement with the Governments of the Commonwealth of Australia, the Kingdom of Belgium, the United States of Brazil, Burma, Canada, Ceylon, the Republic of Chile, the Republic of China, the Republic of Cuba, the Czechoslovak Republic, the French Republic, India, Lebanon, the Grand-Duchy of Luxemburg, the Kingdom of the Netherlands, New Zealand, the Kingdom of Norway, Pakistan, Southern Rhodesia, Syria, the Union of South Africa, and the United Kingdom of Great Britain and Northern Ireland, which trade agreement consists of the General Agreement on Tariffs and Trade and the related Protocol of Provisional Application thereof, together with the Final Act Adopted at the Conclusion of the Second Session of the Preparatory Committee of the United Nations Conference on Trade and Employment which authenticated the texts of said general agreement and said protocol;  on December 16, 1947 by Proclamation 2761A the President proclaimed such modifications of existing duties and other import restrictions of the United States of America and such continuance of existing customs or excise treatment of articles imported into the United States of America as were then found to be required or appropriate to carry out said trade agreement on and after January 1, 1948 (12 F.R"
    },
    {
        "title": "Proclamation 2790—Supplementing Proclamations of December 16, 1947 and January 1, 1948, Carrying Out General Agreement on Tariffs and Trade and Exclusive Trade Agreement with Cuba, Respectively",
        "president": "Harry S Truman",
        "date": "1948-06-11",
        "sentence": "(1946) 1352(c)), on October 30, 1947 the President entered into a trade agreement with the governments of the commonwealth of Australia, the Kingdom of Belgium, the United States of Brazil, Burma, Canada, Ceylon, the Republic of Chile, the Republic of China, the Republic of Cuba, the Czechoslovak Republic, the French Republic, India, Lebanon, the Grand-duchy of Luxemburg, the Kingdom of the Netherlands, New Zealand, the Kingdom of Norway, Pakistan, Southern Rhodesia, Syria, the Union of South Africa, and the United Kingdom of Great Britain and Northern Ireland, which trade agreement consists of the General Agreement on Tariffs and Trade and the related Protocol of Provisional Application thereof, together with the Final Act Adopted at the Conclusion of the Second Session of the Preparatory Committee of the United Nations conference on Trade and Employment which authenticated the texts of said general agreement and said protocol;  on December 16, 1947 by Proclamation 2761A the President proclaimed such modifications of existing duties and other import restrictions of the United States of America and such continuance of existing customs or excise treatment of articles imported into the United States of America as were then found to be required or appropriate to carry out said trade agreement on and after January 1, 1948 (12 F.R"
    },
    {
        "title": "Proclamation 2784—Supplementing Proclamations of December 16, 1947 and January 1, 1948, Carrying Out General Agreement on Tariffs and Trade and Exclusive Trade Agreement with Cuba, Respectively",
        "president": "Harry S Truman",
        "date": "1948-05-04",
        "sentence": "(1946) 1352(c)), on October 30, 1947 the President entered into a trade agreement with the Governments of the Commonwealth of Australia, the Kingdom of Belgium, the United States of Brazil, Burma, Canada, Ceylon, the Republic of Chile, the Republic of China, the Republic of Cuba, the Czechoslovak Republic, the French Republic, India, Lebanon, the Grand-Duchy of Luxemburg, the Kingdom of the Netherlands, new Zealand, the Kingdom of Norway, Pakistan, Southern Rhodesia, Syria, the Union of South Africa, and the United Kingdom of Great Britain and Northern Ireland, which trade agreement consists of the General Agreement on Tariffs and Trade and the related Protocol of Provisional Application thereof, together with the Final Act Adopted at the Conclusion of the Second Session of the Preparatory Committee of the United Nations Conference on Trade and Employment which authenticated the texts of said general agreement and said protocol;  On December 16, 1947 by Proclamation 2761A the President proclaimed such modifications of existing duties and other import restrictions of the United States of America and such continuance of existing customs or excise treatment of articles important into the United States of America as were then found to be required or appropriate to carry out said trade agreement on and after January 1, 1948 (12 F.R"
    },
    {
        "title": "Proclamation 2784—Supplementing Proclamations of December 16, 1947 and January 1, 1948, Carrying Out General Agreement on Tariffs and Trade and Exclusive Trade Agreement with Cuba, Respectively",
        "president": "Harry S Truman",
        "date": "1948-05-04",
        "sentence": "25 and 26), which proclamation has been supplemented by said proclamations of January 30, 1948 and April 22, 1948;  said protocol of provisional application has been signed by the Government of the Republic of China on April 21, 1948, and said Government will be a contracting party to said general agreement on May 22, 1948;  President of the United States of America, determine that the application of such of the concessions provided for in part I of schedule XX of said general agreement which were withheld from application in accordance with article XXVII of said general agreement by said proclamation of December 16, 1947 as are identified in the following list is required or appropriate to carry out, on and after May 22, 1948, said trade agreement specified in the 1st recital of this proclamation:  I determine that it is required that the concessions represented by the second item 212 and the third item 1503 in party I of schedule XX of said general agreement shall be applied as if the portions of said section item 212 relating to the subdescription starting \"Other (except hotel\", and said third item 1503, were stated as follows:  I determine that, in view of the determination set forth in the 6th recital of this proclamation, the deletion of item 1529(a) from the list set forth in the 7th recital of said proclamation of January 30, 1948 is required or appropriate to carry out, on and after May 22, 1948, said trade agreement specified in the 1st recital of this proclamation;  I determine that, in view of the determination set forth in the 6th recital of this proclamation, the following amendments of the lists set forth in the 8th and 9th recitals of said proclamation of January 1, 1948, as amended and rectified, are required or appropriate to carry out, on and after May 22, 1948, said exclusive trade agreement specified in the 3rd recital of this proclamation: (a) The modification of item 1529(a) in said 8th recital to read as follows: 1529(a) Articles (except wearing apparel) in part of handmade lace over 2 inches wide and in part of handmade lace not over 2 inches wide and containing no machine-made material or article provided for in paragraph 1529(a), Tariff Act of 1930, however provided for in said paragraph 1529(a): Valued at $150 or more per pound-----------54% ad val.; (b) The deletion of the following items in said 9th recital: Item (paragraph) \n24 \n397 \n409 [first] \n409 [ second] \n761 [second] \n775 [ second] \n778 \n1504(a) \n1506 \n1507; and (c) The modification of the first item 775 in said 9th recital to read as follows: 775 Vegetables (including horseradish) if pickled or packed in salt or brine (except cucumbers and onions, if pickled, or packed in brine) and not specially provided for .28% ad val.;  The rates of duty in the first item 765 and the third item 1513 in the 9th recital of said proclamation of January 1, 1948 were inadvertently misstated, and I determine that it is required or appropriate to carry out said exclusive trade agreement specified in the 3rd recital of this proclamation that the rate in said first item 765 be changed to \"1.6 cents per lb.\" and the rate in said third item 1513 be changed to \"28% ad val.\"; and  the number of the schedule referred to in item 1537(b) in said 9th recital of said proclamation of January 1, 1948 was inadvertently misstated, and I determine that it is required or appropriate to carry out said exclusive trade agreement specified in the 3rd recital of this proclamation that the number of said schedule be changed to \"Schedule XX\";  be it known that, acting under the authority of said section 350 of the Tariff Act of 1930, as amended: PART I To the end that said trade agreement specified in the 1st recital of this proclamation may be carried out,   President of the United States of America, do proclaim that: (a) Effective on and after May 22, 1948, the concessions provided for in part I of said schedule XX which are identified in the 6th recital of this proclamation shall no longer be identified in the 8th recital of said proclamation of December 16, 1947, and the rates of duty representing such concessions identified in said 6th recital of this proclamation shall be applied, subject to the applicable terms, conditions, and qualifications set forth in said schedule XX, and parts I, II, and III, of said general agreement, and in subdivision (a), other than exception (I) thereof, of said proclamation of December 16, 1947, including in each case any amendments and rectifications which have been proclaimed by the President, to articles of the kinds provided for in the descriptions of products in the column at the left of said rates; (b) The rates of duty specified in the 7th recital of this pr5oclamation shall be applied, subject to the applicable terms, conditions, and qualifications set forth therein, to the articles described in the column at the left of such rates as though said rates, descriptions, and related paragraph numbers had appeared in part I of schedule XX of said general agreement on October 30, 1947; and (c) Effective on and after May 22, 1948, the list set forth in the 7th recital of said proclamation of January 30, 1948, as amended, shall be further amended in the manner indicated in the 8th recital of this proclamation; and PART II To the end that said exclusive trade agreement specified in the 3rd recital of this proclamation may be carried out, I do further proclaim that: (a) Effective on and after May 22, 1948, the lists set forth in the 8th and 9th recitals of said proclamation of January 1, 1948, as amended and rectified, shall be further amended in the manner indicated in the 9th recital of this proclamation; and (b) The list set forth in the 9th recital of said proclamation of January 1, 1948, as amended and rectified, shall be further rectified in the manner indicated in the 10th and 11th recitals of this proclamation effective as though said rectifications had appeared in said 9th recital on January 1, 1948"
    },
    {
        "title": "Proclamation 2782—Supplementing Proclamations of December 16, 1947 and January 1, 1948, Carrying Out General Agreement on Tariffs and Trade and Exclusive Trade Agreement with Cuba, Respectively",
        "president": "Harry S Truman",
        "date": "1948-04-22",
        "sentence": "(1946) 1352 (c)), on October 30, 1947 the President entered into a trade agreement with the Governments of the Commonwealth of Australia, the Kingdom of Belgium, the United States of Brazil, Burma, Canada, Ceylon, the Republic of Chile the Republic of China, the Republic of Cuba, the Czechoslovak Republic, the French Republic, India, Lebanon, the Grand Duchy of Luxemburg, the Kingdom of the Netherlands, new Zealand, the Kingdom of Norway, Pakistan, Southern Rhodesia, Syria, the Union of South Africa, and the United Kingdom of Great Britain and Northern Ireland, which trade agreement consists of the General Agreement on Tariffs and Trade and the related protocol of Provisional Application thereof, together with the Final Act Adopted at the Conclusion of the Second Session of the Preparatory Committee of the United Nations Conference on Trade and Employment which authenticated the texts of said general agreement and said protocol;  on December 16, 1947, by proclamation 2761A the President proclaimed such modifications of existing duties and other import restrictions of the United States of America and such continuance of existing customs or excise treatment of articles imported into the United States of America as were then found to be required or appropriate to carry out said trade agreement on and after January 1, 1948 (12 F.R"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-04-27",
        "sentence": "President, one of the results of the McCarthy  investigation has been a countercharge that he is being fed material by Nationalist China sources"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-04-27",
        "sentence": "I wonder if you would care to make any comment on the suggestion raised by several publications, including the New Republic, for an investigation of the so-called China lobby? THE PRESIDENT"
    },
    {
        "title": "Letter to the Chairman, House Committee on Foreign Affairs, Urging Enactment of the Foreign Assistance Act.",
        "president": "Harry S Truman",
        "date": "1950-03-25",
        "sentence": "It will authorize aid where needed to those free countries in the general area of China whose survival is threatened by the imminent danger of communist infiltration"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-03-02",
        "sentence": "Li, who has been acting President of China? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-03-02",
        "sentence": "He is coming in as the acting President of China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-02-16",
        "sentence": "President, do you have any comment on the agreement between Russia and the Communist government of China? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-02-16",
        "sentence": "Secretary Acheson was quoted as saying that even if the full sum of the Soviet Union's promised economic aid--$300 million over a 5-year period--was forthcoming, it would be meager in comparison with the great economic needs of China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-02-16",
        "sentence": "He further stated that the most significant features of the new agreements were probably covered by secret protocols that would never be made public, but that could be measured only by Russian conduct in China in the months and years to come"
    },
    {
        "title": "Annual Budget Message to the Congress: Fiscal Year 1951",
        "president": "Harry S Truman",
        "date": "1950-01-09",
        "sentence": "In millions ] New obligational \n      Expenditures authority for 1951 \n      1949 1950 1951 Appropria- Program or agency actual estimated estimated tions Other Conduct of foreign affairs: \n      State Department $134 1$187 1 $190 $175 \n      Participation in international organizations \n      (present programs and proposed legislation) 38 58 49 31 \n      Other 1 1 1 (2) \n      International recovery and relief: \n      European recovery program and other foreign aid \n      (present programs and proposed legislation) 4,040 1 4,062 3,250 3,100 \n      Aid to occupied areas 1,349 831 279 320 \n      Aid to Korea (present programs and proposed \n      legislation 1 6 1 93 1 111 115 \n      Reconstruction Finance Corporation \n      (loan repayment) --14 --38 --38 \n      Aid to refugees: \n      International Refugee Organization 73 70 25 25 \n      Displaced persons program (present programs \n      and proposed legislation) 1 5 4 4 \n      Palestine refugees (present programs and \n      proposed legislation) 8 15 20 \n      Other 288 23 3 \n      Foreign economic development: \n      Export-Import Bank loans --57 71 48 \n      Inter-American development 12 11 8 7 $30 \n      Technical assistance to underdeveloped areas \n      (proposed legislation) 25 35 \n      Foreign military assistance: \n      Mutual defense assistance program (present \n      programs and proposed legislation) 160 645 648 500 \n      Greek-Turkish aid (acts of 1947 and 1948) 289 195 \n      Assistance to China (act of 1948 125 \n      Philippine aid 197 211 91 45 Total 6,462 5,964 4,711 3 4,505 530 1 Includes transfer from funds for aid to occupied areas"
    },
    {
        "title": "The President's News Conference on the Budget",
        "president": "Harry S Truman",
        "date": "1950-01-07",
        "sentence": "57), under assistance to China, you have got nothing down for 1950, and, if I have got the right program, I think Congress voted 75 million"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-01-05",
        "sentence": "Traditional United States policy toward China, as exemplified in the open-door policy, called for international respect for the territorial integrity of China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-01-05",
        "sentence": "This principle was recently reaffirmed in the United Nations General Assembly Resolution of December 8, 1949, which, in part, calls on all states, and I quote: \"'To refrain from (a) seeking to acquire spheres of influence or to create foreign controlled regimes within the territory of China; (b) seeking to obtain special rights or privileges within the territory of China.'\" That is the end of the quotation from the United Nations Resolution"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-01-05",
        "sentence": "In the Joint Declaration at Cairo on December 1, 1943, the President of the United States, the British Prime Minister, and the President of China stated that it was their purpose that territories Japan had stolen from China, such as Formosa, should be restored to the Republic of China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-01-05",
        "sentence": "The United States Government will not pursue a course which will lead to involvement in the civil conflict in China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-01-05",
        "sentence": "The United States Government proposes to continue under existing legislative authority the present ECA program of economic assistance.\" At 2:30 this afternoon Dean Acheson will hold a press conference and further elaborate on the details with reference to this statement which I have just issued on the policy of the United States Government toward China and Formosa"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-12-22",
        "sentence": "It's a part of Nationalist China, and we still recognize Nationalist China as the government of China"
    },
    {
        "title": "Proclamation 2867—Carrying Out the Annecy Protocol of Terms of Accession to the General Agreement on Tariffs and Trade, Dated October 10, 1949, and Supplementing the Proclamations of December 16, 1947, and January 1, 1948",
        "president": "Harry S Truman",
        "date": "1949-12-22",
        "sentence": "410), until the expiration of three years from June 12, 1945, on October 30, 1947, the President entered into a trade agreement with the Governments of the Commonwealth of Australia, the Kingdom of Belgium, the United States of Brazil, Burma, Canada, Ceylon, the Republic of Chile, the Republic of China, the republic of Cuba, the Czechoslovak Republic, the French Republic, India, Lebanon, the Grand Duchy of Luxemburg, the Kingdom of the Netherlands, New Zealand, the Kingdom of Norway, Pakistan, Southern Rhodesia, Syria, the Union of South Africa, and the United Kingdom of Great Britain and Northern Ireland, which trade agreement consists of the General Agreement on Tariffs and Trade and the related Protocol of Provisional Application thereof, together with the Final Act Adopted at the Conclusion of the Second Session of the Preparatory Committee of the United Nations Conference on Trade and Employment, which authenticated the texts of the said general agreement and the said protocol (Treaties and other International Acts Series 1700); 2"
    },
    {
        "title": "Proclamation 2865—Supplementing the Proclamations of December 16, 1947, and January 1, 1948, Carrying Out the General Agreement on Tariffs and Trade and the Exclusive Trade Agreement with Cuba, Respectively, and Terminating in Part the Proclamation of January 30, 1948",
        "president": "Harry S Truman",
        "date": "1949-11-30",
        "sentence": "410), until the expiration of three years from June 12, 1945, on October 30, 1947, the President entered into a trade agreement with the Governments of the Commonwealth of Australia, the Kingdom of Belgium, the United States of Brazil, Burma, Canada, Ceylon, the Republic of Chile, the Republic of China, the Republic of Cuba, the Czechoslovak Republic, the French Republic, India, Lebanon, the Grand Duchy of Luxemburg, the Kingdom of the Netherlands, New Zealand, the Kingdom of Norway, Pakistan, Southern Rhodesia, Syria, the Union of South Africa, and the United Kingdom of Great Britain and Northern Ireland, which trade agreement consists of the General Agreement on Tariffs and Trade and the related Protocol of Provisional Application thereof, together with the Final Act Adopted at the Conclusion of the Second Session of the Preparatory Committee of the United Nations Conference on Trade and Employment, which authenticated the texts of the said general agreement and the said protocol (Treaties and Other International Acts Series 1700); 2"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-10-27",
        "sentence": "President, have you reached any decision yet regarding the possibility of recognition of the Communist Government of China? THE PRESIDENT"
    },
    {
        "title": "The President's Special Conference With the Association of Radio News Analysts",
        "president": "Harry S Truman",
        "date": "1949-10-19",
        "sentence": "President, I was talking to a former member of the OSS in China, and he was deeply concerned about removal of our consulates there"
    },
    {
        "title": "The President's Special Conference With the Association of Radio News Analysts",
        "president": "Harry S Truman",
        "date": "1949-10-19",
        "sentence": "They at least have listening posts in China"
    },
    {
        "title": "The President's Special Conference With the Association of Radio News Analysts",
        "president": "Harry S Truman",
        "date": "1949-10-19",
        "sentence": "Yes, but otherwise in the rest of China we have other consular officials-- THE PRESIDENT"
    },
    {
        "title": "The President's Special Conference With the Association of Radio News Analysts",
        "president": "Harry S Truman",
        "date": "1949-10-19",
        "sentence": "President, in view of the current trend in China, under what circumstances would we recognize the Communist regime there? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-11",
        "sentence": "President, following publication of the white paper on China, will there be any change in our attitude toward Chinese Communist-dominated areas? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-11",
        "sentence": "Will there be any change in our attitude toward Communist-dominated areas of China? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-11",
        "sentence": "The policy on China is the same policy that it has always been"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-11",
        "sentence": "President, in line with your statement just now that you are not favorable to the Communists in China, would you like to say definitely now that we will not recognize the government of China-- THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-11",
        "sentence": "I am not in a position to say anything about the government of China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-11",
        "sentence": "The white paper covers everything that I can say on China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-04",
        "sentence": "[Reading]: \"The Department of State is publishing tomorrow a volume on the United States relations with China, particularly during the last 5 years"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-04",
        "sentence": "United States Relations With China: With Special Reference to the Period 1944-1949"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-04",
        "sentence": "\"My primary purpose in having this frank and factual record released at this time is to insure that our policy toward China and the Far East as a whole shall be based on informed and intelligent public opinion"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-04",
        "sentence": "It is the result of the democratic process, and represents the collective judgment of the people.' \"The role of this Government in its relations with China has been subject to considerable misrepresentation, distortion, and misunderstanding"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-04",
        "sentence": "Some of these attitudes arose because this Government was reluctant to reveal certain facts, the publication of which might have served to hasten the events in China which have now occurred"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-04",
        "sentence": "In the present situation, however, the mutual interests of the United States and China require full and frank discussion of the facts"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-04",
        "sentence": "\"The Secretary of State in transmitting this record has made a clear and illuminating statement of the situation that exists in China, the nature of the problems that are presented, and the governing principles of our policies toward China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-04",
        "sentence": "\"The warm feeling of friendship between the people of the United States and the people of China has been one of the most notable facts in American foreign relations"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-04",
        "sentence": "The problem of finding ways to give practical expression to that friendship will continue to receive, day in and day out, the closest attention of this Government, and I know that it will receive the hopeful, constructive, forward-looking thought of the American people.\" Now this China paper will be ready for distribution to the press at 2 o'clock today, at the State Department, and I will show you what a nice chore you are going to have"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-04",
        "sentence": "And it's complete and factual, and there's everything in it that you want to know about the China policy from the 1840's to the present day"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-04",
        "sentence": "And if you will take the time to carefully read and study it, you will know just about as much about China policy as the President does, and I think I know more about it than anybody else"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-04",
        "sentence": "President, the present controversy over the American policy, as I see it--and I think possibly as you see it, too, aside from your official knowledge--is that we were too slow in doing something for China because of Communist influence in Washington, or Red influence, and that's-- THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-04",
        "sentence": "President, are we allowed to take any new steps in China on China policy? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-04",
        "sentence": "Read the China policy book"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-08-04",
        "sentence": "President, on the China situation, do you see any possibility of China being rescued from the Communists? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-06-30",
        "sentence": "John Foster Dulles have recently complained that in respect to China the administration is not following a bipartisan foreign policy"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-06-30",
        "sentence": "Do you draw any distinction between China and anywhere else? THE PRESIDENT"
    },
    {
        "title": "Remarks at a Masonic Breakfast.",
        "president": "Harry S Truman",
        "date": "1951-02-21",
        "sentence": "It is a tremendous outlook that we have for the future of the world as a whole, if we can develop the undeveloped parts of the world to meet the pressure of populations in countries like China and India and central Europe"
    },
    {
        "title": "Joint Statement Following Discussions With Prime Minister Pleven of France.",
        "president": "Harry S Truman",
        "date": "1951-01-30",
        "sentence": "Minister to the Associated States of Indo-China, Charles E"
    },
    {
        "title": "Joint Statement Following Discussions With Prime Minister Pleven of France.",
        "president": "Harry S Truman",
        "date": "1951-01-30",
        "sentence": "With regard to Indo-China, the Prime Minister described the heavy responsibilities borne by France in that area and the great cost, both in lives and money, she has paid in resisting the communist onslaught in order to maintain the security and independence of the Associated States, Viet Nam, Cambodia, and Laos"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1951-01-18",
        "sentence": "President, now that the Chinese Communists have rejected the ceasefire proposal, will we try to get the United Nations to brand Communist China as an aggressor? THE PRESIDENT"
    },
    {
        "title": "Annual Budget Message to the Congress: Fiscal Year 1952",
        "president": "Harry S Truman",
        "date": "1951-01-15",
        "sentence": "We are also providing economic assistance to help meet urgent problems in various parts of Southeast Asia, including Indonesia, Indo-China, Burma, Thailand, and Formosa, and a developmental program in the Philippines is being inaugurated"
    },
    {
        "title": "Annual Message to the Congress on the State of the Union",
        "president": "Harry S Truman",
        "date": "1951-01-08",
        "sentence": "If their efforts are successful, they foment a revolution, as they did in Czechoslovakia and China, and as they tried, unsuccessfully, to do in Greece"
    },
    {
        "title": "Annual Message to the Congress on the State of the Union",
        "president": "Harry S Truman",
        "date": "1951-01-08",
        "sentence": "We have demonstrated it in our relations with Indonesia, India, and with China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1951-01-04",
        "sentence": "President, are we going to ask the United Nations for permission to bomb China ? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1951-01-04",
        "sentence": "You said you were--that the Government did not have under consideration asking the United Nations for permission to bomb China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1951-01-04",
        "sentence": "President, is it correct to assume that we would not bomb China without checking it with the United Nations? THE PRESIDENT"
    },
    {
        "title": "Proclamation 2916—Allocating Tariff Quota on Certain Petroleum Products Under the Venezuelan Trade Agreement",
        "president": "Harry S Truman",
        "date": "1950-12-29",
        "sentence": "410 and 411), the period for the exercise of the authority under the said section 350 having been extended by section 1 of the said act of July 5, 1945, until the expiration of three years from June 12, 1945), on October 30, 1947, I entered into a trade agreement with the Governments of the Commonwealth of Australia, the Kingdom of Belgium, the United States of Brazil, Burma, Canada, Ceylon, the Republic of Chile, the Republic of China, the Republic of Cuba, the Czechoslovak Republic, the French Republic, India, Lebanon, the Grand Duchy of Luxemburg, the Kingdom of the Netherlands, New Zealand, the Kingdom of Norway, Pakistan, Southern Rhodesia, Syria, the Union of South Africa, and the United Kingdom of Great Britain and Northern Ireland, which trade agreement consists of the General Agreement on Tariffs and Trade and the related Protocol of Provisional Application thereof, together with the Final Act Adopted at the Conclusion of the Second Session of the Preparatory Committee of the United Nations Conference on Trade and Employment which authenticated the texts of the said General Agreement and the said Protocol (61 Stat"
    },
    {
        "title": "Joint Statement Following Discussions With the Prime Minister of Great Britain.",
        "president": "Harry S Truman",
        "date": "1950-12-08",
        "sentence": "We considered two questions regarding China which are already before the United Nations"
    },
    {
        "title": "Joint Statement Following Discussions With the Prime Minister of Great Britain.",
        "president": "Harry S Truman",
        "date": "1950-12-08",
        "sentence": "The United Kingdom has recognized the Central People's Government and considers that its representatives should occupy China's seat in the United Nations"
    },
    {
        "title": "Joint Statement Following Discussions With the Prime Minister of Great Britain.",
        "president": "Harry S Truman",
        "date": "1950-12-08",
        "sentence": "We believe that the communist leaders of the Soviet Union and China could, if they chose, modify their conduct in such a way as to make these defense preparations unnecessary"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-11-30",
        "sentence": "This has been done despite prolonged and earnest efforts to bring home to the Communist leaders of China the plain fact that neither the United Nations nor the United States has any aggressive intentions toward China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-11-30",
        "sentence": "Because of the historic friendship between the people of the United States and China, it is particularly shocking to us to think that Chinese are being forced into battle against our troops in the United Nations command"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-11-30",
        "sentence": "There is, however, no indication that the representatives of Communist China are willing to engage in this process"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-11-30",
        "sentence": "The action against Communist China depends on the action of the United Nations"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-11-16",
        "sentence": "Planes operating from bases in China cross over into Korea to attack United Nations ground and air forces, and then flee back across the border"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-11-16",
        "sentence": "Speaking for the United States Government and people, I can give assurance that we support and are acting within the limits of United Nations policy in Korea, and that we have never at any time entertained any intention to carry hostilities into China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-11-16",
        "sentence": "So far as the United States is concerned, I wish to state unequivocally that because of our deep devotion to the cause of world peace and our long-standing friendship for the people of China we will take every honorable step to prevent any extension of the hostilities in the Far East"
    },
    {
        "title": "Proclamation 2912—Terminating in Part the Proclamation of December 16, 1947, So as to Give Effect to the Withdrawal of Tariff Concessions with Respect to Certain Fur Felt Hats and Hat Bodies",
        "president": "Harry S Truman",
        "date": "1950-10-30",
        "sentence": "410, 411), the period for the exercise of the authority under the said section 350 having been extended by section 1 of the said act of July 5, 1945 until the expiration of three years from June 12, 1945), on October 30, 1947, I entered into a trade agreement with the Governments of the Commonwealth of Australia, the Kingdom of Belgium, the United States of Brazil, Burma, Canada, Ceylon, the Republic of Chile, the Republic of China, the Republic of Cuba, the Czechoslovak Republic, the French Republic, India, Lebanon, the Grand Duchy of Luxemburg, the Kingdom of the Netherlands, New Zealand, the Kingdom of Norway, Pakistan, Southern Rhodesia, Syria, the Union of South Africa, and the United Kingdom of Great Britain and Northern Ireland, which trade agreement consists of the General Agreement on Tariffs and Trade and the related Protocol of Provisional Application thereof, together with the Final Act Adopted at the Conclusion of the Second Session of the Preparatory Committee of the United Nations Conference on Trade and Employment which authenticated the texts of the said General Agreement and the said Protocol (61 Stat"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-10-26",
        "sentence": "President, last night Harold Stassen, president of the University of Pennsylvania, said in a radio address that after the election the Truman administration plans to quietly embrace the regime of Mao Tse-tung, and to encourage the seating of Communist China in the United Nations"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-10-19",
        "sentence": "President, did you discuss the admission of Red China to the United Nations? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-10-19",
        "sentence": "He wanted to know if we discussed the admission of Red China to the United Nations, and I said I did not discuss that"
    },
    {
        "title": "Proclamation 2908—Terminating in Part Proclamation No. 2761A of December 16, 1947 and Certain Proclamations Supplemental Thereto, and Supplementing Proclamation No. 2764 of January 1, 1948 and Proclamation No. 2769 of January 30, 1948",
        "president": "Harry S Truman",
        "date": "1950-10-12",
        "sentence": "410), the period for the exercise of the authority under the said section 350 having been extended by section 1 of the said act of July 5, 1945, until the expiration of three years from June 12, 1945 ), on October 30, 1947, I entered into a trade agreement with the Governments of the Commonwealth of Australia, the Kingdom of Belgium, the United States of Brazil, Burma, Canada, Ceylon, the Republic of Chile, the Republic of China, the Republic of Cuba, the Czechoslovak Republic, the French Republic, India, Lebanon, the Grand Duchy of Luxemburg, the Kingdom of the Netherlands, New Zealand, the Kingdom of Norway, Pakistan, Southern Rhodesia, Syria, the Union of South Africa, and the United Kingdom of Great Britain and Northern Ireland, which trade agreement consists of the General Agreement on Tariffs and Trade and the related Protocol of Provisional Application thereof, together with the Final Act Adopted at the Conclusion of the Second Session of the Preparatory Committee of the United Nations Conference on Trade and Employment which authenticated the texts of the said General Agreement and the said Protocol (61 Stat"
    },
    {
        "title": "Proclamation 2908—Terminating in Part Proclamation No. 2761A of December 16, 1947 and Certain Proclamations Supplemental Thereto, and Supplementing Proclamation No. 2764 of January 1, 1948 and Proclamation No. 2769 of January 30, 1948",
        "president": "Harry S Truman",
        "date": "1950-10-12",
        "sentence": " , the Secretary General of the United Nations has informed the Secretary of State that on March 76, 1950, he was notified that it was the decision of the Government of the Republic of China, which was then a contracting party to the said General Agreement, to withdraw from the General Agreement on Tariffs and Trade, in accordance with paragraphs 5 of the Protocol of Provisional Application of the General Agreement and the Government of China is therefore no longer such a contracting party"
    },
    {
        "title": "Proclamation 2908—Terminating in Part Proclamation No. 2761A of December 16, 1947 and Certain Proclamations Supplemental Thereto, and Supplementing Proclamation No. 2764 of January 1, 1948 and Proclamation No. 2769 of January 30, 1948",
        "president": "Harry S Truman",
        "date": "1950-10-12",
        "sentence": "  the concessions provided for in Part I of Schedule XX of the said General Agreement which are identified in the following list were initially negotiated with the Government of the Republic of China within the terms of the said Article XXVII: 7"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-09-21",
        "sentence": "President, General Marshall, before the Senate committee, disclaimed personal responsibility for our China policy of 1946"
    },
    {
        "title": "Proclamation 2901—Termination of Mexican Trade Agreement Proclamation and Supplementing Proclamations No. 2769 of January 30, 1948, No. 2764 of January 1, 1948, and No. 2761ZA of December 16, 1947",
        "president": "Harry S Truman",
        "date": "1950-09-06",
        "sentence": "410), until the expiration of three years from June 12, 1945, on October 30, 1947, I entered into a trade agreement with the Governments of the Commonwealth of Australia, the Kingdom of Belgium, the United States of Brazil, Burma, Canada, Ceylon, the Republic of Chile, the Republic of China, the Republic of Cuba, the Czechoslovak Republic, the French Republic, India, Lebanon, the Grand Duchy of Luxemburg, the Kingdom of the Netherlands, New Zealand, the Kingdom of Norway, Pakistan, Southern Rhodesia, Syria, the Union of South Africa, and the United Kingdom of Great Britain and Northern Ireland, which trade agreement consists of the General Agreement on Tariffs and Trade and the related Protocol of Provisional Application thereof, together with the Final Act Adopted at the Conclusion of the Second Session of the Preparatory Committee of the United Nations Conference on Trade and Employment which authenticated the texts of the said General Agreement and the said Protocol; 2"
    },
    {
        "title": "Address Broadcast from the Voice of America floating Radio Transmitter Courier.",
        "president": "Harry S Truman",
        "date": "1952-03-04",
        "sentence": "for almost two centuries the people of the United States have lived at peace with the peoples of Russia and China and other countries whose rulers are now assailing us"
    },
    {
        "title": "Address Broadcast from the Voice of America floating Radio Transmitter Courier.",
        "president": "Harry S Truman",
        "date": "1952-03-04",
        "sentence": "Only a decade ago, when the peoples of Russia and China were suffering under two of the most savage invasions in history, we came to their aid"
    },
    {
        "title": "Joint Statement Following Discussions With Prime Minister Churchill.",
        "president": "Harry S Truman",
        "date": "1952-01-09",
        "sentence": "A broad harmony of view has emerged from these discussions; for we recognize that the overriding need to counter the Communist threat in that area transcends such divergencies as there are in our policies toward China"
    },
    {
        "title": "Proclamation 2954—Terminating in Part Proclamation No. 2761A of December 16, 1947 and Proclamations Supplemental Thereto, and for Other Purposes",
        "president": "Harry S Truman",
        "date": "1951-11-26",
        "sentence": "410), the period for the exercise of the authority under the said section 350 having been extended by section 1 of the said act of July 5, 1945, until expiration of three years from June 12, 1945), on October 30, 1947, I entered into a trade agreement with the Governments of the Commonwealth of Australia, the Kingdom of Belgium, the United States of Brazil, Burma, Canada, Ceylon, the Republic of Chile, the Republic of China, the Republic of Cuba, the Czechoslovak Republic, the French Republic, India, Lebanon, the Grand Duchy of Luxemburg, the Kingdom of the Netherlands, New Zealand, the Kingdom of Norway, Pakistan, Southern Rhodesia, Syria, the Union of South Africa, and the United Kingdom of Great Britain and Northern Ireland, which trade agreement consists of the General Agreement on Tariffs and Trade and the related Protocol of Provisional Application thereof, together with the Final Act at the Conclusion of the Second Session of the Preparatory Committee of the United Nations Conference on Trade and Employment which authenticated the texts of the said General Agreement and the said Protocol (61 Stat"
    },
    {
        "title": "Proclamation 2954—Terminating in Part Proclamation No. 2761A of December 16, 1947 and Proclamations Supplemental Thereto, and for Other Purposes",
        "president": "Harry S Truman",
        "date": "1951-11-26",
        "sentence": "  the Secretary General of the United Nations has informed the Secretary of State that on March 6, 1950, he was notified that it was the decision of the Government of the Republic of China, which was then a contracting party to the said General Agreement specified in the first recital of this proclamation, to withdraw from the said General Agreement, in accordance with paragraph 5 of the Protocol of Provisional Application thereof specified in the first recital of this proclamation, and the Government of China is therefore no longer such a contracting party; 4"
    },
    {
        "title": "Proclamation 2954—Terminating in Part Proclamation No. 2761A of December 16, 1947 and Proclamations Supplemental Thereto, and for Other Purposes",
        "president": "Harry S Truman",
        "date": "1951-11-26",
        "sentence": "  the concessions provided for in Part I of Schedule XX (original) of the said General Agreement specified in the first recital of this proclamation which are identified in the following list were initially negotiated with the Government of the Republic of China within the terms of the said Article XXVII: 6"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1951-10-18",
        "sentence": "President, I suppose you have read that General MacArthur told the American Legion in Miami that his opposition had wrecked a secret plan to get Formosa to fall to the Chinese Reds, and give Red China a seat in the United Nations ? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1951-10-11",
        "sentence": "President, have you found any new records in connection with the dispute over the conference with Senator Vandenberg and others on the China policy "
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1951-10-11",
        "sentence": "Stassen's allegations that withdrawal of aid to Nationalist China had been proposed as a \"dramatic peace move\" at a White House conference in October 1949"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1951-10-04",
        "sentence": "Stassen testified on the Hill, dealing with aid to China?   There seems to be a little confusion-- \nTHE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1951-10-04",
        "sentence": "Stassen, president of the University of Pennsylvania, stated before the Subcommittee on Internal Security of the Senate Judiciary Committee that a White House conference had been held in October 1949 during which the proposal had been made to withdraw all aid from Chiang Kai-shek's government in China"
    },
    {
        "title": "Letter to the Chairman, Senate Committee on Appropriations, on U.S. Contributions to the U.N. and Other International Organizations.",
        "president": "Harry S Truman",
        "date": "1951-08-07",
        "sentence": "In the United Nations and its specialized agencies, no major power has yet failed to pay its full contribution as assessed, save only China, beset as we all know by very special problems"
    },
    {
        "title": "Proclamation 2935—Giving Effect to Sections 5 and 11 of the Trade Agreements Extension Act of 1951",
        "president": "Harry S Truman",
        "date": "1951-08-01",
        "sentence": "The President shall, as soon as practicable, take such measures as may be necessary to prevent the importation of ermine, fox, kolinsky, marten, mink, muskrat, and weasel furs and skins, dressed or undressed, which are the product of the Union of Soviet Socialist Republics or of Communist China"
    },
    {
        "title": "Special Message to the Congress: The President's Midyear Economic Report",
        "president": "Harry S Truman",
        "date": "1951-07-23",
        "sentence": "Whatever happens in Korea, we must take into account what is happening in Iran, on the borders of Yugoslavia, in Indo-China, and, most of all, what we know to be going on inside the Soviet Union itself"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1951-07-19",
        "sentence": "and Communist China"
    },
    {
        "title": "Address at the Ceremonies Commemorating the 175th Anniversary of the Declaration of Independence.",
        "president": "Harry S Truman",
        "date": "1951-07-04",
        "sentence": "We are not fighting there to conquer China, or to destroy the Soviet Empire"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1951-06-28",
        "sentence": "President, how is that investigation of the China lobby coming along? THE PRESIDENT"
    },
    {
        "title": "Address in Tullahoma, Tenn., at the Dedication of the Arnold Engineering Development Center.",
        "president": "Harry S Truman",
        "date": "1951-06-25",
        "sentence": "We came to the aid of China when it was threatened by Communist civil war"
    },
    {
        "title": "Address in Tullahoma, Tenn., at the Dedication of the Arnold Engineering Development Center.",
        "president": "Harry S Truman",
        "date": "1951-06-25",
        "sentence": "We put billions of dollars worth of arms and supplies into China to aid the Chinese Nationalist Government"
    },
    {
        "title": "Address in Tullahoma, Tenn., at the Dedication of the Arnold Engineering Development Center.",
        "president": "Harry S Truman",
        "date": "1951-06-25",
        "sentence": "But many of the generals of Nationalist China took our aid and surrendered"
    },
    {
        "title": "Address in Tullahoma, Tenn., at the Dedication of the Arnold Engineering Development Center.",
        "president": "Harry S Truman",
        "date": "1951-06-25",
        "sentence": "We can investigate the situation in China from now until doomsday, but the facts will always remain the same: China was taken over by the Communists because of the failure of the Nationalist Government to mobilize the strength of China to maintain its freedom"
    },
    {
        "title": "Proclamation 2929—Carrying Out the Torquay Protocol to the General Agreement on Tariffs and Trade and for Other Purposes",
        "president": "Harry S Truman",
        "date": "1951-06-02",
        "sentence": "410), the period for the exercise of the authority under the said section 350 having been extended by section 1 of the said act of July 5, 1945, until the expiration of three years from June 12, 1945), on October 30, 1947, I entered into a trade agreement with the Governments of the Commonwealth of Australia, the Kingdom of Belgium, the United States of Brazil, Burma, Canada, Ceylon, the Republic of Chile, the Republic of China, the Republic of Cuba, the Czechoslovak Republic, the French Republic, India, Lebanon, the Grand Duchy of Luxembourg, the Kingdom of the Netherlands, New Zealand, the Kingdom of Norway, Pakistan, Southern Rhodesia, Syria, the Union of South Africa, and the United Kingdom of Great Britain and Northern Ireland, which trade agreement consists of the General Agreement on Tariffs and Trade and the related Protocol of Provisional Application thereof, together with the Final Act Adopted at the Conclusion of the Second Session of the Preparatory Committee of the United National Conference on Trade and Employment which authenticated the texts of the said General Agreement and the said Protocol (61 Stat"
    },
    {
        "title": "Statement by the President on the Foreign Aid Rider in the Third Supplemental Appropriation Act.",
        "president": "Harry S Truman",
        "date": "1951-06-02",
        "sentence": "In addition to the controls that apply generally to exports to countries in the Soviet bloc, shipment of all commodities to China is forbidden and United States ships are not allowed to call at Chinese ports"
    },
    {
        "title": "Statement by the President on the Foreign Aid Rider in the Third Supplemental Appropriation Act.",
        "president": "Harry S Truman",
        "date": "1951-06-02",
        "sentence": "In addition to these steps, the United Nations on May 18, 1951, by a vote of 47 to o, agreed to a complete embargo on the shipment of strategic materials to Communist China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1951-05-24",
        "sentence": "At his press conference on May 23, Secretary of State Dean Acheson stated that the policy of the United States toward China had not changed, and that the United States Government still hoped to be able to negotiate a Korean peace settlement with the Communist regime in Peiping"
    },
    {
        "title": "Letter to Committee Chairmen on the Need for Continuing Aid to the United Kingdom, France, and Italy.",
        "president": "Harry S Truman",
        "date": "1952-12-30",
        "sentence": "While making its defense contribution in Europe, France is carrying the burden of a war against Communists in Indo-China"
    },
    {
        "title": "Address at the National War College",
        "president": "Harry S Truman",
        "date": "1952-12-19",
        "sentence": "China was one of those"
    },
    {
        "title": "Address at the National War College",
        "president": "Harry S Truman",
        "date": "1952-12-19",
        "sentence": "With all our material help, and that material help was very great, the Government of China was not able to save itself"
    },
    {
        "title": "Address at the National War College",
        "president": "Harry S Truman",
        "date": "1952-12-19",
        "sentence": "Let no one think that this administration underestimates the effects of the Communist victory in China"
    },
    {
        "title": "Address at the Hotel Sherman in Chicago",
        "president": "Harry S Truman",
        "date": "1952-10-29",
        "sentence": "The second way is to go on from Korea to a bigger war, attacking China and Russia, expanding the theater of conflict to include Japan, the Pacific, and possibly the whole world"
    },
    {
        "title": "Rear Platform and Other Informal Remarks in Minnesota",
        "president": "Harry S Truman",
        "date": "1952-10-28",
        "sentence": "In the far East, one general almost got us into a much bigger war--against China and Russia--and I had to remove him"
    },
    {
        "title": "Rear Platform and Other Informal Remarks in Minnesota",
        "president": "Harry S Truman",
        "date": "1952-10-28",
        "sentence": "On the other hand, if we had followed the advice of some of our generals, we would have gotten ourselves involved in a large-scale war in China and Russia"
    },
    {
        "title": "Rear Platform and Other Informal Remarks in Montana and Idaho",
        "president": "Harry S Truman",
        "date": "1952-10-01",
        "sentence": "You know, they have lobbies down there-the power trust, and they have the real estate lobby, and they have the China lobby, and they have the oil lobbies, and they have lobbies for this, that, and the other thing"
    },
    {
        "title": "Rear Platform Remarks in Montana",
        "president": "Harry S Truman",
        "date": "1952-09-30",
        "sentence": "And before I get through with this trip, I will take them one at a time and prove it to you--that they run the Republican Party all the time, from the China lobby to the lobby on oil"
    },
    {
        "title": "Rear Platform and Other Informal Remarks in Pennsylvania",
        "president": "Harry S Truman",
        "date": "1952-10-22",
        "sentence": "You know, I say down in Washington that there is the oil lobby, there is the China lobby, there is the real estate lobby, the National Association of Manufacturers lobby, and the only lobbyist that the common everyday man has in Washington to look after his interests entirely is the President of the United States"
    },
    {
        "title": "Rear Platform and Other Informal Remarks in Pennsylvania",
        "president": "Harry S Truman",
        "date": "1952-10-22",
        "sentence": "And you know the reason you have to be so careful in this election, they have the oil lobby and the real estate lobby and the China lobby and the National Association of Manufacturers, and the only man in Washington who represents all the people and is elected by all the people and who is the people's lobbyist is the President of the United States"
    },
    {
        "title": "Rear Platform and Other Informal Remarks in New Hampshire and Massachusetts",
        "president": "Harry S Truman",
        "date": "1952-10-17",
        "sentence": "Now, you know, down in Washington there is the real estate lobby, there is the China lobby, there is the lobby for the National Association of Manufacturers, there is the lobby for the chamber of commerce"
    },
    {
        "title": "Rear Platform and Other Informal Remarks in New York",
        "president": "Harry S Truman",
        "date": "1952-10-10",
        "sentence": "The big banks, the power companies, the oil companies, the real estate lobby--and worst of all the China lobby, and the rest of that crew--they are the people who foot the bills for the Republican Party"
    },
    {
        "title": "Address in the Oakland Auditorium",
        "president": "Harry S Truman",
        "date": "1952-10-04",
        "sentence": "The one tragic exception was the Republic of China"
    },
    {
        "title": "Address in the Oakland Auditorium",
        "president": "Harry S Truman",
        "date": "1952-10-04",
        "sentence": "We sent over $2 billion worth of economic and military aid to China, but in spite of this, the Chinese Government was unable to marshal its resources or lead its people successfully"
    },
    {
        "title": "Address in the Oakland Auditorium",
        "president": "Harry S Truman",
        "date": "1952-10-04",
        "sentence": "We helped China, but China proved unable to help herself"
    },
    {
        "title": "Address in the Oakland Auditorium",
        "president": "Harry S Truman",
        "date": "1952-10-04",
        "sentence": "Except for China, the free nations, with our aid, have held the line throughout the rest of the world"
    },
    {
        "title": "Rear Platform and Other Informal Remarks in Minnesota, North Dakota, and Montana",
        "president": "Harry S Truman",
        "date": "1952-09-29",
        "sentence": "In short, it's all the special privilege groups from the oil lobby to the China lobby, and they've all joined together behind the Republican Party"
    },
    {
        "title": "Rear Platform and Other Informal Remarks in Minnesota, North Dakota, and Montana",
        "president": "Harry S Truman",
        "date": "1952-09-29",
        "sentence": "Then, later on, they tried to start an all-out war with China"
    },
    {
        "title": "Annual Message to the Congress on the State of the Union.",
        "president": "Harry S Truman",
        "date": "1953-01-07",
        "sentence": "Beyond its borders, East and West, are the nearly five million square miles of the satellite states--virtually incorporated into the Soviet Union--and of China, now its close partner"
    },
    {
        "title": "Annual Message to the Congress on the State of the Union.",
        "president": "Harry S Truman",
        "date": "1953-01-07",
        "sentence": "The Soviet Union, with its satellites, and China are held in the tight grip of communist party chieftains"
    },
    {
        "title": "Annual Message to the Congress on the State of the Union.",
        "president": "Harry S Truman",
        "date": "1953-01-07",
        "sentence": "Where conditions permitted, the Soviet rulers have stimulated and aided armed insurrection by communist-led revolutionary forces, as in Greece, Indo-China, the Philippines, and China, or outright aggression by one of their satellites, as in Korea"
    },
    {
        "title": "Annual Message to the Congress on the State of the Union.",
        "president": "Harry S Truman",
        "date": "1953-01-07",
        "sentence": "Here, in spite of outside aid and support, the free government of China succumbed to the communist assault"
    },
    {
        "title": "Annual Message to the Congress on the State of the Union.",
        "president": "Harry S Truman",
        "date": "1953-01-07",
        "sentence": "In other areas of the Far East-in Indo-China, Malaya, and the Philippines--our assistance has helped sustain a staunch resistance against communist insurrectionary attacks"
    },
    {
        "title": "Annual Message to the Congress on the State of the Union.",
        "president": "Harry S Truman",
        "date": "1953-01-07",
        "sentence": "Just in the years I have been President, 12 free nations, with more than 600 million people, have become independent: Burma, Indonesia, the Philippines, Korea, Israel, Libya, India, Pakistan and Ceylon, and the three Associated States of Indo-China, now members of the French Union"
    },
    {
        "title": "Address at a Dinner of the Jewish National fund.",
        "president": "Harry S Truman",
        "date": "1952-05-26",
        "sentence": "And the people who led the fight--now listen to this, this is good, for these meat axe cuts in Asia are the very same people who howl the loudest about losing China to the Communists-now I wonder, do they want to save India from the fate of China, or would they rather let India be gobbled up by the Communists too, so they can have another calamity to blame on the administration ? Now let's take the case of Iran"
    },
    {
        "title": "Special Message to the Congress on the Mutual Security Program.",
        "president": "Harry S Truman",
        "date": "1952-03-06",
        "sentence": "The free nations are holding the line against aggression in Korea and Indo-China, and are battling communist inspired disorders in Burma, Malaya, and the Philippines"
    },
    {
        "title": "Special Message to the Congress on the Mutual Security Program.",
        "president": "Harry S Truman",
        "date": "1952-03-06",
        "sentence": "Of our military assistance, a large part will go to Indo-China where the troops of the french Union and of the Associated States are battling valiantly against the communist led forces, and another large part will go to continue to help prepare the Chinese armies on formosa to resist communist aggression"
    },
    {
        "title": "Radio and Television Address to the American People on the Mutual Security Program.",
        "president": "Harry S Truman",
        "date": "1952-03-06",
        "sentence": "Since the shadow of Communist control has darkened China, India stands as the largest democratic nation in all Asia"
    },
    {
        "title": "Special Message to the Congress on the Mutual Security Program.",
        "president": "Harry S Truman",
        "date": "1951-05-24",
        "sentence": "Moreover, some of these countries--notably France and Britain-have sizeable forces fighting in Malaya, Indo-China, and Korea, and have other important overseas defense commitments"
    },
    {
        "title": "Special Message to the Congress on the Mutual Security Program.",
        "president": "Harry S Truman",
        "date": "1951-05-24",
        "sentence": "Using the weapons of subversion, false propaganda and civil war, the Kremlin has already reduced China to the status of a satellite"
    },
    {
        "title": "Special Message to the Congress on the Mutual Security Program.",
        "president": "Harry S Truman",
        "date": "1951-05-24",
        "sentence": "Communist rebellion is raging in Indo-China"
    },
    {
        "title": "Special Message to the Congress on the Mutual Security Program.",
        "president": "Harry S Truman",
        "date": "1951-05-24",
        "sentence": "Military assistance under this program will go to the Chinese armies on Formosa, to help keep that island out of the hands of Communist China"
    },
    {
        "title": "Special Message to the Congress on the Mutual Security Program.",
        "president": "Harry S Truman",
        "date": "1951-05-24",
        "sentence": "It will go to Indo-China, where over 100,000 French troops are fighting side-by-side with the forces of Viet Nam, Laos, and Cambodia against communist-led forces"
    },
    {
        "title": "Special Message to the Congress on the Mutual Security Program.",
        "president": "Harry S Truman",
        "date": "1951-05-24",
        "sentence": "France is supplying the largest part of the military supplies needed in Indo-China, and Britain is supplying her forces which are fighting guerrillas in the Malay States"
    },
    {
        "title": "Special Message to the Congress on the Mutual Security Program.",
        "president": "Harry S Truman",
        "date": "1951-05-24",
        "sentence": "In addition, the funds I am now recommending will provide necessary economic support for defense programs in Indo-China, Formosa, and the Philippines"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1951-05-17",
        "sentence": "3 3 General MacArthur's statement on Korea, dated March 24, 1951, said in part, \"The enemy therefore must by now be painfully aware that a decision of the United Nations to depart from its tolerant effort to contain the war to the area of Korea through expansion of our military operations to his coastal areas and interior bases would doom Red China to the risk of imminent military collapse"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1951-05-17",
        "sentence": "\"These basic facts being established, there should be no insuperable difficulty arriving at decisions on the Korean problem if the issues are resolved on their own merits without being burdened by extraneous matters not directly related to Korea, such as Formosa and China's seat in the United Nations.\" The text of the statement was released by the White House on April 11, 1951, at the same time that General MacArthur was relieved of his Far East command"
    },
    {
        "title": "Address at the National Conference on Citizenship.",
        "president": "Harry S Truman",
        "date": "1951-05-17",
        "sentence": "And this same Senator wants to go for an all-out war in China all by ourselves"
    },
    {
        "title": "Address at a Dinner of the Civil Defense Conference.",
        "president": "Harry S Truman",
        "date": "1951-05-07",
        "sentence": "Furthermore, a deep involvement on our part in a war in China, whatever the outcome there, would have critical military consequences in Europe"
    },
    {
        "title": "Address at a Dinner of the Civil Defense Conference.",
        "president": "Harry S Truman",
        "date": "1951-05-07",
        "sentence": "In China the failure of the Korean adventure is weakening the hold of the Communist government"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1951-04-26",
        "sentence": " On April 21 the New York Times printed a summary of the Wake Island conversations based on what the writer described as \"documented sources on the meeting.\" Among other things the article stated that General MacArthur had expressed doubt that Red China would intervene in Korea and was so confident of victory that he offered what he regarded as his best troops for service in Europe"
    },
    {
        "title": "Address at the Jefferson-Jackson Day Dinner.",
        "president": "Harry S Truman",
        "date": "1951-04-14",
        "sentence": "They want us to get out of Korea--but they urge us to wage an aggressive war against China"
    },
    {
        "title": "Address at the Jefferson-Jackson Day Dinner.",
        "president": "Harry S Truman",
        "date": "1951-04-14",
        "sentence": "Now, beat that one, if you can! They say it will provoke Russia to attack if we send troops to Europe--but they are sure Russia won't be provoked if we carry the war to China"
    },
    {
        "title": "Radio Report to the American People on Korea and on U.S. Policy in the Far East.",
        "president": "Harry S Truman",
        "date": "1951-04-11",
        "sentence": "Why don't we bomb Manchuria and China itself? Why don't we assist the Chinese Nationalist troops to land on the mainland of China ? If we were to do these things we would be running a very grave risk of starting a general war"
    },
    {
        "title": "Radio Report to the American People on Korea and on U.S. Policy in the Far East.",
        "president": "Harry S Truman",
        "date": "1951-04-11",
        "sentence": "What would suit the ambitions of the Kremlin better than for our military forces to be committed to a full-scale war with Red China? It may well be that, in spite of our best efforts, the Communists may spread the war"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1951-03-29",
        "sentence": "President, there has been a step-up of shipments of war materials, such as oil and scrap, etc., into China through Hong Kong"
    },
    {
        "title": "Radio and Television Report to the American People on the Situation in Korea.",
        "president": "Harry S Truman",
        "date": "1950-09-01",
        "sentence": "Fourth: We hope in particular that the people of China will not be misled or forced into fighting against the United Nations and against the American people, who have always been and still are their friends"
    },
    {
        "title": "Radio and Television Report to the American People on the Situation in Korea.",
        "president": "Harry S Truman",
        "date": "1950-09-01",
        "sentence": "Only the Communist imperialism, which has already started to dismember China, could gain from China's involvement in the war"
    },
    {
        "title": "Radio and Television Report to the American People on the Situation in Korea.",
        "president": "Harry S Truman",
        "date": "1950-09-01",
        "sentence": "The Communist imperialists are the only ones who can gain if China moves into this fight"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-08-31",
        "sentence": "President, how great do you regard the danger of Red China becoming involved in the action in Korea ? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-08-31",
        "sentence": "I hope that there is no great danger that Red China will become involved in this United Nations approach to establishing peace in Korea"
    },
    {
        "title": "Letter to Ambassador Warren Austin Restating the U.S. Position on Formosa.",
        "president": "Harry S Truman",
        "date": "1950-08-27",
        "sentence": "\"(1) The United States has not encroached on the territory of China, nor has the United States taken aggressive action against China"
    },
    {
        "title": "Letter to Ambassador Warren Austin Restating the U.S. Position on Formosa.",
        "president": "Harry S Truman",
        "date": "1950-08-27",
        "sentence": "We still feel the friendship and know that millions of Chinese reciprocate it, We took the lead with others in the last United Nations General Assembly to secure approval of a resolution on the integrity of China"
    },
    {
        "title": "Special Message to the Congress Reporting on the Situation in Korea.",
        "president": "Harry S Truman",
        "date": "1950-07-19",
        "sentence": "Nevertheless, the United Nations continued its efforts to obtain a freely-elected government for all of Korea, and at the time of the attack, a United Nations Commission, made up of representatives of seven nations-Australia, China, El Salvador, France, India, the Philippines and Turkey-was in the Republic of Korea"
    },
    {
        "title": "Special Message to the Congress Reporting on the Situation in Korea.",
        "president": "Harry S Truman",
        "date": "1950-07-19",
        "sentence": "In view of this, I have already directed that United States forces in support of the Philippines be strengthened, and that military assistance be speeded up to the Philippine Government and to the Associated States of Indo-China and to the forces of France in Indo-China"
    },
    {
        "title": "Statement by the President Upon Signing the Foreign Economic Assistance Act.",
        "president": "Harry S Truman",
        "date": "1950-06-05",
        "sentence": "It authorizes, second, continued aid to the free peoples of Korea, southeast Asia, and non-Communist China"
    },
    {
        "title": "Statement by the President Upon Signing the Foreign Economic Assistance Act.",
        "president": "Harry S Truman",
        "date": "1950-06-05",
        "sentence": "The benefits of American support to independent Korea, non-Communist China, and certain new countries in southeast Asia have been considerable"
    },
    {
        "title": "Special Message to the Congress on Military Aid.",
        "president": "Harry S Truman",
        "date": "1950-06-01",
        "sentence": "The $75,000,000 which the Congress authorized last year for assistance to countries in the general area of China has been available to help these nations ward off the threat to their security from subversive communist forces within their countries, and to help them prevent the further extension of communist imperialism in the Far East"
    },
    {
        "title": "Special Message to the Congress on Military Aid.",
        "president": "Harry S Truman",
        "date": "1950-06-01",
        "sentence": "Programs of assistance to countries in this area, such as Into-China, are now underway"
    },
    {
        "title": "Special Message to the Congress on Military Aid.",
        "president": "Harry S Truman",
        "date": "1950-06-01",
        "sentence": "The rapidly changing conditions in and around China require the constant re-evaluation of the situation in that area, and constant readiness to act in the interests of peace when we can do so effectively"
    },
    {
        "title": "Special Message to the Congress on Military Aid.",
        "president": "Harry S Truman",
        "date": "1950-06-01",
        "sentence": "Accordingly, I recommend the authorization of an additional $75,000,000 for military assistance to countries in the general area of China during the next fiscal year"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-05-25",
        "sentence": "Yesterday, Bevin  said that he would like to see Communist China seated in the United Nations in order to break the Russian deadlock"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1950-05-25",
        "sentence": "I wonder if we have changed our opinion and now would be willing to see Communist China seated ? THE PRESIDENT"
    },
    {
        "title": "Proclamation 2888—Supplementing Proclamations No. 2867 of December 22, 1949, No. 2769 of January 30, 1948, and No. 2764 of January 1, 1948 Relating to Trade Agreements",
        "president": "Harry S Truman",
        "date": "1950-05-13",
        "sentence": "410), until the expiration of three years from June 12, 1945, on October 30, 1947, I entered into a trade agreement with the Governments of the Commonwealth of Australia, the Kingdom of Belgium, the United States of Brazil, Burma, Canada, Ceylon, the Republic of Chile, the Republic of China, the Republic of Cuba, the Czechoslovak Republic, the French Republic, India, Lebanon, the Grand Duchy of Luxemburg, the Kingdom of the Netherlands, New Zealand, the Kingdom of Norway, Pakistan, Southern Rhodesia, Syria, the Union of South Africa, and the United Kingdom of Great Britain and Northern Ireland, which trade agreement consists of the General Agreement on Tariffs and Trade and the related Protocol of Provisional Application thereof, together with the Final Act Adopted at the Conclusion of the Second Session of the Preparatory Committee of the United Nations Conference on Trade and Employment which authenticated the texts of the said general agreement and the said protocol; 4"
    },
    {
        "title": "Address in Laramie, Wyoming.",
        "president": "Harry S Truman",
        "date": "1950-05-09",
        "sentence": "While our support of the new nations of Asia has been of real benefit to them, we have recently been unable to be of any assistance at all to the people of one vast area-China"
    },
    {
        "title": "Address in Laramie, Wyoming.",
        "president": "Harry S Truman",
        "date": "1950-05-09",
        "sentence": "Their new taskmasters have been heartlessly indifferent to the worst famine which has occurred in China in 100 years"
    },
    {
        "title": "Address in Laramie, Wyoming.",
        "president": "Harry S Truman",
        "date": "1950-05-09",
        "sentence": "The attitude of the present authorities in China has forced the withdrawal of American official representatives from that country"
    },
    {
        "title": "Address in Laramie, Wyoming.",
        "president": "Harry S Truman",
        "date": "1950-05-09",
        "sentence": "However, there are still a number of American religious, educational, and charitable organizations which have representatives in China who might be able to help out"
    },
    {
        "title": "Address in Laramie, Wyoming.",
        "president": "Harry S Truman",
        "date": "1950-05-09",
        "sentence": "We are now trying to find a way for the Government to get food into the hands of these private agencies for distribution in China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-06-09",
        "sentence": "President, an emissary from the President of China said today that he would like to talk to you about plans for defending China"
    },
    {
        "title": "Special Message to the Congress Recommending Continuation of Economic Assistance to Korea.",
        "president": "Harry S Truman",
        "date": "1949-06-07",
        "sentence": "In the Cairo Declaration of December, 1943, the United States joined with the United Kingdom and China to express their determination that in due course Korea should become free and independent"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-06-02",
        "sentence": "President, there is a report in Manila that the President of the Philippines is coming here to discuss American policy in China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-04-28",
        "sentence": "The Navy has done an excellent job in Chinese waters from one end of China to the other"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-04-28",
        "sentence": "They have made arrangements for the evacuation of all American citizens in China who want to be evacuated"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-04-28",
        "sentence": "And the Navy is still able to evacuate any people and to protect American citizens, if it becomes necessary, in Shanghai or any other port in China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-04-28",
        "sentence": "President, do you expect to discuss the China situation today with Secretary of State Acheson, and Senators Wherry and Bridges? THE PRESIDENT"
    },
    {
        "title": "Remarks at a Meeting with the American Society of Newspaper Editors",
        "president": "Harry S Truman",
        "date": "1949-04-22",
        "sentence": "The anticipated expenditures for the whole European recovery program and the rearmament program, and what has already been spent in China in the hopes of rehabilitation of the Chinese Government, will not amount to one-third of that canceled appropriation of 1946"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-03-24",
        "sentence": "President, can you tell us whether there is likely to be any statement on the China situation in the near future? THE PRESIDENT"
    },
    {
        "title": "Proclamation 2829—Supplementing Proclamations of December 16, 1947 and January 1, 1948, Carrying Out General Agreement on Tariffs and Trade and Exclusive Trade Agreement with Cuba, Respectively",
        "president": "Harry S Truman",
        "date": "1949-03-08",
        "sentence": "269), on October 30, 1947 the President entered into a trade agreement with the Governments of the Commonwealth of Australia, the Kingdom of Belgium, the United States of Brazil, Burma, Canada, Ceylon, the Republic of Chile, the Republic of China, the Republic of Cuba, the Czechoslovak Republic, the French Republic, India, Lebanon, the Grand Duchy of Luxemburg, the Kingdom of the Netherlands, new Zealand, the Kingdom of Norway, Pakistan, Southern Rhodesia, Syria, the Union of South Africa, and the United Kingdom of Great Britain and Northern Ireland, which trade agreement consists of the General Agreement on Tariffs and Trade and the related Protocol of Provisional Application thereof, together with the Final Act Adopted at the Conclusion of the Second Session of the Preparatory Committee of the United Nations Conference on Trade and Employment which authenticated the texts of said general agreement and said protocol;  on December 16, 1947, by Proclamation 2761A the President proclaimed such modifications of existing duties and other import restrictions of the United States of America and such continuance of existing customs or excise treatment of articles imported into the United States of America as were then found to be required or appropriate to carry out said trade agreement on and after January 1, 1948 (3 CFR, 1947 Supp., Proc"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1949-02-03",
        "sentence": "Would you think the setting aside of a day as a day of prayer--I mean a national day of prayer like we did during the last days of the war, to pray especially for the world's dilemma and the situation in China, would be advisable? THE PRESIDENT"
    },
    {
        "title": "Annual Budget Message to the Congress: Fiscal Year 1950",
        "president": "Harry S Truman",
        "date": "1949-01-10",
        "sentence": "In millions] 1950 \nExpenditures net new \n1948 1949 1950 appro- \nactual estimated estimated priations \nReconstruction and military aid: \nEconomic Cooperation Act--ERP \n(existing and proposed legislation) $154 $4,600 $4,500 $4,300 \nOther proposed aid legislation 355 600 \nGreek-Turkish Aid (acts of 1947 \nand 1948) 186 285 136 \nExport-Import Bank loans 460 0 146 \nTreasury loan to the \nUnited Kingdom 1,700 \nReconstruction Finance \nCorporation 4 --31 --35 \nForeign relief: \nArmy (occupied areas) 965 1,265 1,030 1,000 \nAssistance to China (act of 1948) 1 350 49 \nOther (mainly under Foreign Aid \nAct, UNRRA and post-UNRRA) 1,027 185 7 \nPalestinian refugee program \n(proposed legislation) 16 \nDisplaced Persons Commission 1 2 5 \nForeign relations: \nDepartment of State: \nPresent programs 144 171 171 160 \nProposed legislation (mainly \nwar damage claims) 17 1 2 \nOther 5 7 4 1 \nPhilippine war damage and \nrehabilitation: \nWar damage claims (Philippine \nWar Damage Commission) 23 171 165 165 \nRehabilitation program 25 51 46 4 \nInterest on deposits (Treasury) 2 4 3 3 \nParticipation in international \norganizations: \nInternational Refugee Organization 69 73 70 70 \nOther present programs 18 53 57 31 \nFAO building loan and ITO \n(proposed legislation) 2 8 Total 4,782 7,219 6,709  6,349 In addition, this Budget includes 17 million dollars of appropriations recommended to liquidate prior year contract authorizations"
    },
    {
        "title": "Annual Budget Message to the Congress: Fiscal Year 1950",
        "president": "Harry S Truman",
        "date": "1949-01-10",
        "sentence": "These now include aid to Greece, Turkey, China, and Korea"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-03-11",
        "sentence": "President, on the subject of United States policy toward China, is it still the policy of this Government to favor the inclusion of Chinese Communists in the Chinese Government? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-03-11",
        "sentence": "The United States wanted--is already on friendly relations with the Government of China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-03-11",
        "sentence": "It recognizes the Government of China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-03-11",
        "sentence": "We have been trying to help the recognized Government of China to maintain peace in the Far East"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-03-11",
        "sentence": "President, along that line, could you amplify for us now a little bit what was the purpose of sending General Marshall to China at the time? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-03-11",
        "sentence": "President, Secretary Marshall, just before he became Secretary of State, in his report on China,   did recommend the broadening of the base of the Chinese Government, that Communists be included? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-03-11",
        "sentence": "We don't want a Communist government in China, or anywhere else, if we can help it"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-03-11",
        "sentence": "There is a very great difference between the liberal element in China and the Communists"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-03-11",
        "sentence": "There are a great many liberals in China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1948-03-11",
        "sentence": "There are a great many of them who have been educated in this country, and they are the intelligentsia, really, of China"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "I now request the Congress to consider the type of further assistance which this country should provide to China"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "A genuine friendship has existed between the American people and the people of China over many years"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "The vast size and population of China make her an important factor in world affairs"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "China is a land with rich tradition and culture and a large and energetic population"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "It has always been our desire to see a strong progressive China making a full contribution to the strength of the family of nations"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "With this end in view, we have supported the National Government of China since it first came to power 20 years ago"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "China and the United States were allies in the war against Japan and as an ally we supported China's valiant war efforts against the Japanese"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "The United States contributed the major share of the extensive aid received by China under the program of the United Nations Relief and Rehabilitation Administration"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "We made available to the Chinese Government at minimum cost large quantities of surplus goods and equipment of value to China's economy"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "We are currently extending further aid to China under our foreign relief program"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "Under these circumstances China's foreign exchange holdings have been so reduced that it will soon be impossible for China to meet the cost of essential imports"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "Ever since the return of General Marshall from China, the problem of assistance to the Chinese has been under continuous study"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "We have hoped for conditions in China that would make possible the effective and constructive use of American assistance in reconstruction and rehabilitation"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "United States assistance to China, like that provided to any other nation, must be adapted to its particular requirements and capacities"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "In the light of these factors, I recommend that the Congress authorize a program for aid to China in the amount of $570 million to provide assistance until June 30, 1949"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "The program should make provision for the financing, through loans or grants, of essential imports into China in the amount of $510 million"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "As in the case of aid to European recovery, the conduct of this program of aid should be made subject to an agreement between China and the United States setting forth the conditions and procedures for administering the aid"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "Pending establishment of the agency which is to be set up for the administration of the European Recovery Program, the assistance to China should be carried forward under the existing machinery now administering the foreign relief programs"
    },
    {
        "title": "Special Message to the Congress on the Need for Assistance to China.",
        "president": "Harry S Truman",
        "date": "1948-02-18",
        "sentence": "The proposed program of aid to China represents what I believe to be the best course this Government can follow in the light of all the circumstances"
    },
    {
        "title": "Special Message to the Congress on Civil Rights",
        "president": "Harry S Truman",
        "date": "1948-02-02",
        "sentence": "The Congress has recently removed the bars which formerly prevented persons from China, India and the Philippines from becoming naturalized citizens"
    },
    {
        "title": "Proclamation 2769—Supplementing Proclamations of December 16, 1947 and January 1, 1948, Carrying Out General Agreement on Tariffs and Trade and Exclusive Trade Agreement with Cuba, Respectively",
        "president": "Harry S Truman",
        "date": "1948-01-30",
        "sentence": "V, 1352(c)), on October 30, 1947 the President entered into a trade agreement with the Government of the Commonwealth of Australia, the Kingdom of Belgium, the United States of Brazil, Burma, Canada, Ceylon, the Republic of Chile, the Republic of China, the Republic of Cuba, the Czechoslovak Republic, the French Republic, India, Lebanon, the Grand-Duchy of Luxemburg, the Kingdom of the Netherlands, new Zealand, the Kingdom of Norway, Pakistan, Southern Rhodesia, Syria, the Union of South Africa, and the United Kingdom of Great Britain and Northern Ireland, which trade agreement consists of the General Agreement on Tariffs and Trade and the related Protocol of Provisional Application thereof, together with the Final Act adopted at the conclusion of the Second Session of the Preparatory Committee of the United Nations Conference on Trade and Employment which authenticated the texts of said general agreement and said protocol;  on December 16, 1947 by Proclamation 2761A the President proclaimed such modifications of existing duties and other import restrictions of the United States of America and such continuance of existing customs or excise treatment of articles imported into the United States of America as were then found to be required or appropriate to carry out said trade agreement on and after January 1, 1948 (12 F.R"
    },
    {
        "title": "Annual Budget Message to the Congress, Fiscal Year 1949",
        "president": "Harry S Truman",
        "date": "1948-01-12",
        "sentence": "Of this, 4.4 billion dollars is needed for our aid to the European recovery program and for aid to other countries, including China"
    },
    {
        "title": "Annual Budget Message to the Congress, Fiscal Year 1949",
        "president": "Harry S Truman",
        "date": "1948-01-12",
        "sentence": "The appropriation already enacted will provide \"stopgap\" assistance through next March to the European countries in most urgent need--France, Italy, and Austria--as well as aid to China"
    },
    {
        "title": "Annual Budget Message to the Congress, Fiscal Year 1949",
        "president": "Harry S Truman",
        "date": "1948-01-12",
        "sentence": "In addition to the European recovery program, other international-aid programs for several countries, including China, are provided for under proposed legislation"
    },
    {
        "title": "Annual Budget Message to the Congress, Fiscal Year 1949",
        "president": "Harry S Truman",
        "date": "1948-01-12",
        "sentence": "In millions ] Anticipated supplemental \nExpenditure appropriations \nestimate, \nFunction and program 1949 1948 1949 \nNational defense: \nUniversal training program $400 $500 \nDrill pay for military reserve components 13 16 \nMilitary and naval construction 166 $165 45 \nInternational affairs and finance: \nEuropean recovery program 4, 000 6,800 \nOther foreign aid (including China) 440 300 450 \nForeign informational and cultural program 17 6 20 \nLoan for United Nations headquarters construction 30 65 \nUnited States participation in \ninternational organizations 4 4 \nPhilippine war veterans' benefits 16 16 \nPhilippine rehabilitation (1) (1) \nWar damage claims 17 \nSocial welfare, health, and security: \nNational health program, administrative expenses 15 15 \nGeneral public welfare program, public \nassistance benefits 100 100 \nStream pollution abatement 1 1 \nHousing and community facilities: \nLong-range housing program 40 37 \nAdvances for public works planning 10 20 \nEducation and general research: \nAid for elementary and secondary education 290 300 \nNational Science Foundation 5 15 \nRadio propagation building, \nNational Bureau of Standards 1 1 \nAgriculture and agricultural resources: \nRevision of price support program --50 \nTransportation and communication: \nIncrease in postage rates to eliminate \npostal deficit  \nAlaska communications system ( ) $1 \nConstruction of Federal Communications \nCommission facilities ( ) ( ) \nAddition to Post Office equipment shops $1 1 \nCoast Guard--additional ocean weather stations 12 1 \nCensus of transportation 1 1 \nExtension of Maritime Commission's authority \nto operate and charter vessels  \nAlaskan airport construction 2 2 \nResearch facilities--National Advisory \nCommittee for Aeronautics 2 10 \nFinance, commerce, and industry: \nCensus of business 9 12 \nCensus of mineral industries (1) ( ) \nNew anti-inflation program 80 $24 85 \nExtension of rent control 28 4 30 \nLabor: \nNational Commission Against \nDiscrimination in Employment 1 1 \nIndustrial safety program 6 6 \nGeneral government: \nSurplus property disposal 94 105 \nArmy cemeterial expense 2 2 \nWeather Bureau--observers for additional \nocean weather stations 1 1 Total 5,735 7,381 1,811  Less than one-half million dollars"
    },
    {
        "title": "The President's News Conference on the Budget",
        "president": "Harry S Truman",
        "date": "1948-01-10",
        "sentence": "Do you say anything about the total for China, Mr"
    },
    {
        "title": "The President's News Conference on the Budget",
        "president": "Harry S Truman",
        "date": "1948-01-10",
        "sentence": "president, besides China and the European nations? THE PRESIDENT"
    },
    {
        "title": "The President's News Conference on the Budget",
        "president": "Harry S Truman",
        "date": "1948-01-10",
        "sentence": "Well, China is the principal one, and the 16 European nations, and of course there are situations in the Far East which may need looking into the same as the 16 nations in Europe"
    },
    {
        "title": "Annual Message to the Congress on the State of the Union",
        "president": "Harry S Truman",
        "date": "1948-01-07",
        "sentence": "A special program of assistance to China, to provide urgent relief needs and to speed reconstruction, will be submitted to the Congress"
    },
    {
        "title": "Special Message to the Congress on the Marshall Plan.",
        "president": "Harry S Truman",
        "date": "1947-12-19",
        "sentence": "Since the war's end, we have provided China with varied and important assistance which has aided that nation substantially"
    },
    {
        "title": "Special Message to the Congress on the Marshall Plan.",
        "president": "Harry S Truman",
        "date": "1947-12-19",
        "sentence": "Extensive study has been given during the last few months to the means by which we might best aid in meeting the special needs for relief and rehabilitation in China"
    },
    {
        "title": "Proclamation 2761A—Carrying Out General Agreement on Tariffs and Trade Concluded at Geneva, October 30, 1947",
        "president": "Harry S Truman",
        "date": "1947-12-16",
        "sentence": "(1940) 1304(a)(3)(J).);  President of the United States of America, have found as a fact that certain existing duties and other import restrictions of the United States of America, the Commonwealth of Australia, the Kingdom of Belgium, the United States of Brazil, Burma, Canada, Ceylon, the Republic of Chile, the Republic of China, the Republic of Cuba, the Czechoslovak Republic, the French Republic, India, Lebanon, the Grand-Duchy of Luxemburg, the Kingdom of the Netherlands, New Zealand, the Kingdom of Norway, Pakistan, Southern Rhodesia, Syria, the Union of South Africa, and the United Kingdom of Great Britain and Northern Ireland are unduly burdening and restricting the foreign trade of the United States of America and that the purpose declared in said section 350(a) of the Tariff Act of 1930, as amended, will be promoted by a trade agreement between the Government of the United States of America and the Governments of some or all of the above-named countries;  reasonable public notice of the intention to negotiate such trade agreement was given and the views presented by persons interested in the negotiation thereof were received and considered; , after seeking and obtaining information and advice with respect thereto from the United States Tariff Commission, the Departments of State, Agriculture, Commerce, the Army, and the Navy, and from other sources, on October 30, 1947 I entered, through my duly empowered Plenipotentiary, into a trade agreement with the Governments of the above-named countries, which trade agreement, consisting of the General Agreement on Tariffs and Trade including nine annexes and twenty schedules and the related Protocol of Provisional Application of the General Agreement on Tariffs and Trade, together with the Final Act Adopted at the Conclusion of the Second Session of the United Nations Conference on Trade and Employment which authenticated the texts of said general agreement is authentic in the English and French languages as indicated and is embodied in the document annexed to this proclamation;  the Governments of the United States of America, the Commonwealth of Australia, Canada, and the Grand-Duchy of Luxemburg, and, in respect of their respective metropolitan territories, the Governments of the Kingdom of Belgium, the French Republic, the Kingdom of the Netherlands, and the United Kingdom of Great Britain and Northern Ireland, having signed said protocol prior to November 15, 1947, will apply provisionally, on and after January 1, 1948, pursuant to paragraph 1 thereof, (a) parts I and III of said general agreement and (b) part II thereof to the fullest extent not inconsistent with existing legislation;  I determine, in accordance with the provisions of article XXVII of said general agreement, that the concessions provided for in part I of schedule XX of said general agreement which are identified in the following list should not be applied so long as such concessions are identified in such list;  I find that such modifications of existing duties and other import restrictions and such continuance of existing customs or excise treatment of articles are hereinafter proclaimed will be required or appropriate, on and after January 1, 1948, to carry out said trade agreement;  I find that the suspension of the effectiveness of the proviso to subdivision (J) of section 304(a)(3) of the Tariff Act of 1930, as amended, is required, except with respect to bundles of red-cedar shingles, to carry out said trade agreement:  President of the United States of America, to the end that said trade agreement may be carried out and acting under the authority of the said sections 304 and 350 of the Tariff Act of 1930, as amended, do hereby proclaim, effective on and after January 1, 1948 and subject to the provisions of said protocol and to the exceptions and conditions set forth in subdivisions (a), (b), and (c) below, such modifications of existing duties and other import restrictions of the United States of America and such continuance of existing customs or excise treatment of articles imported into the United States of America as are specified or provided for in parts I, II, and III, annexes D, H, and I, and part I of, and the general notes in, schedule XX of said general agreement: (a) The rates of duty and import tax specified in the column at the right of the respective descriptions of products in part I of schedule XX of the said general agreement shall be applied, subject to the applicable terms, conditions, and qualifications set forth in that schedule and in parts I, II, or III of that agreement, to all articles of the kinds provided for in the said descriptions, except that no such rate shall be applied to a particular article by virtue of this proclamation if, when the article is entered, or withdrawn from warehouse, for consumption,-- (I) The rate represents a concession identified in the list set forth in the 8th recital of this proclamation, (II) The rate is specified in item 720(a), item 745, item 806(b), or the first item 1529(a) in part I of schedule XX of said general agreement as set forth in the document annexed to this proclamation or (III) More favorable customs treatment is prescribed for the article by a statute, proclamation, or executive order then in effect; (b) The rates of duty specified in the 9th recital of this proclamation shall be applied respectively to the articles described in the column at the left of such rates as though the said rates, descriptions, and related paragraph numbers appeared in part I of schedule XX of said general agreement; and (c) Nothing in this proclamation shall be construed as authorizing the application of any rate of duty or import tax computed on the basis of the provisions of article I of the said general agreement, except such rates as may hereafter be proclaimed pursuant to the provisions of section 350, Tariff Act of 1930, as amended;  I do further proclaim that, on and after January 1, 1948, the effectiveness of said proviso to subdivision (J) of section 304(a)(3) of the Tariff Act of 1930, as amended, shall be suspended, except with respect to bundles of red-cedar shingles"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1946-03-08",
        "sentence": "He is going back in the same capacity in which he is working, as Special Envoy to China"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1946-02-21",
        "sentence": "President, the report of Edwin Locke on China is sort of gathering dust"
    },
    {
        "title": "The President's News Conference",
        "president": "Harry S Truman",
        "date": "1946-02-21",
        "sentence": "It will be released when General Marshall's work is completed in China"
    }
]